eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
constexpr const char* kPanelType = "hub75_p2_5_128x64_smd2121_scan32";
#ifndef MICA_TEST_LED_GPIO
#define MICA_TEST_LED_GPIO -1
#endif
constexpr int kTestLedPin = MICA_TEST_LED_GPIO;
#if defined(RGB_BUILTIN)
constexpr int kOnboardTestLedPin = RGB_BUILTIN;
#elif defined(PIN_NEOPIXEL)
constexpr int kOnboardTestLedPin = PIN_NEOPIXEL;
#else
constexpr int kOnboardTestLedPin = -1;
#endif

constexpr unsigned long kTestLedDurationMs = 1500;
constexpr unsigned long kTestLedTogglePeriodMs = 120;
constexpr uint16_t kTestLedPwmFrequencyHz = 5000;
constexpr uint8_t kTestLedPwmResolutionBits = 8;

constexpr const char* kFirmwareProfile = "dma_exp";
constexpr const char* kFirmwareVersion = MICA_FIRMWARE_VERSION;
constexpr uint8_t kBrightnessSafeMin = 30;
constexpr uint8_t kBrightnessSafeMax = 160;
constexpr uint8_t kBrightnessDefaultCap = 160;
constexpr const char* kWifiStateConnecting = "connecting";
constexpr const char* kWifiStateConnected = "connected";
constexpr const char* kWifiStatePortal = "portal";
constexpr const char* kWifiStateDisconnected = "disconnected";
constexpr const char* kSerialProvisioningProtocol = "mica.serial.v1";
constexpr const char* kPrefsOtaCommandId = "ota_cmd";
constexpr const char* kPrefsOtaSourceVersion = "ota_src";
constexpr const char* kPrefsOtaTargetVersion = "ota_tgt";

#if defined(MICA_SECURITY_PROFILE_RELEASE)
constexpr const char* kSecurityProfile = "release";
#else
constexpr const char* kSecurityProfile = "dev";
#endif

Preferences gPrefs;
WebSocketsClient gWs;
WiFiClient gMqttNetClient;
PubSubClient gMqtt(gMqttNetClient);
String gServerHost;
uint16_t gServerPort = 5272;
String gMqttHost;
uint16_t gMqttPort = kDefaultMqttPort;
String gMqttRootTopic = kDefaultMqttRootTopic;
String gDeviceId;
String gToken;
String gActiveAppId;
String gActiveAppName;
String gActiveAppConfig;
portMUX_TYPE gStreamBufferMux = portMUX_INITIALIZER_UNLOCKED;
uint8_t gBinsBuffers[2][kBinsCount] = {};
uint8_t gBinsActiveIndex = 0;
uint8_t gLevel = 0;
uint8_t gBinsFlags = 0;
uint8_t gStreamBrightness = 255;
uint8_t gBrightnessCap = kBrightnessDefaultCap;
uint16_t gFrameRgb565Buffers[2][kMatrixPixelCount] = {};
uint8_t gFrameRgb565ActiveIndex = 0;
unsigned long gLastFrameMs = 0;
unsigned long gWsDisconnectedSinceMs = 0;
unsigned long gMqttDisconnectedSinceMs = 0;
unsigned long gWifiDisconnectedSinceMs = 0;
unsigned long gLastTelemetryMs = 0;
unsigned long gTestLedUntilMs = 0;
unsigned long gTestLedNextToggleMs = 0;
bool gTestLedState = false;
bool gTestLedEnabled = false;
bool gTestLedPwmReady = false;
bool gAuxLedAvailable = false;
bool gOnboardTestLedAvailable = false;
uint8_t gTestLedDuty = 0;
uint8_t gTestLedPulseDuty = 0;
bool gMatrixReady = false;
bool gMatrixFrameDirty = false;
bool gPendingMatrixPresentCountsAsApplied = false;
bool gMatrixSignalTimedOut = false;
uint8_t gAppliedBrightness = 255;
bool gFrameModeActive = false;
uint32_t gLastMatrixPresentUs = 0;
uint32_t gHub75PresentFrames = 0;
unsigned long gLoopWindowStartMs = 0;
uint32_t gLoopWindowIterationCount = 0;
uint32_t gLoopWindowHealthyCount = 0;
uint8_t gLoopHealthyPercent = 0;
bool gLoopHealthyPercentReady = false;
uint32_t gPerfLoopMaxUs = 0;
uint32_t gPerfNetworkMaxUs = 0;
uint32_t gPerfRenderMaxUs = 0;
uint32_t gPerfSerialMaxUs = 0;
uint32_t gPerfLastReportLoopMaxUs = 0;
uint32_t gPerfLastReportNetworkMaxUs = 0;
uint32_t gPerfLastReportRenderMaxUs = 0;
uint32_t gPerfLastReportSerialMaxUs = 0;
uint32_t gPerfRenderSkipCount = 0;
unsigned long gPerfLastReportMs = 0;
uint32_t gPerfHub75PresentFramesAtLastReport = 0;
uint32_t gTelemetrySequence = 0;
uint32_t gDeviceLogSequence = 0;
bool gHasStreamLastSequence = false;
uint32_t gStreamLastSequence = 0;
uint32_t gStreamFramesReceived = 0;
uint32_t gStreamFramesApplied = 0;
uint32_t gStreamSequenceGapCount = 0;
uint32_t gStreamInvalidFrameCount = 0;
uint32_t gNetworkPollDeferCount = 0;
bool gProvisioningPortalActive = false;
String gWifiState = kWifiStateConnecting;
String gLastWifiEvent = "boot";
Hub75FallbackState gHub75FallbackState = Hub75FallbackState::None;
Hub75FallbackState gHub75FallbackPendingState = Hub75FallbackState::None;
unsigned long gHub75FallbackPendingSinceMs = 0;
bool gHub75FallbackDirty = false;
bool gHub75FallbackClearPending = false;
bool gOtaInProgress = false;
uint8_t gOtaProgressPercent = 0;
const char* gOtaProgressStage = "";

enum class OtaTaskResult : uint8_t {
  Idle = 0,
  Running = 1,
  Success = 2,
  Failed = 3,
};

volatile OtaTaskResult gOtaTaskResult = OtaTaskResult::Idle;
TaskHandle_t gOtaDownloadTaskHandle = nullptr;
String gOtaBridgeCommandId;
String gOtaBridgeTargetVersion;
uint8_t gOtaBridgeLastPercent = 0;
String gAuxLedUnavailableReason;
String gSerialInputBuffer;
unsigned long gLastSerialHelloMs = 0;
unsigned long gWsFlapWindowStartMs = 0;
uint16_t gWsConnectCountInWindow = 0;
uint16_t gWsDisconnectCountInWindow = 0;
String gPendingOtaCommandId;
String gPendingOtaSourceVersion;
String gPendingOtaTargetVersion;
String gPendingOtaFailureCode;
String gPendingOtaFailureMessage;
unsigned long gPendingOtaValidationStartedMs = 0;
bool gPendingOtaPendingVerifyAnnounced = false;
uint8_t gRgb5To8Lut[32] = {0};
uint8_t gRgb6To8Lut[64] = {0};
uint8_t gBinsPeakHeights[kMatrixWidth] = {0};
uint8_t gBinsHistory[kMatrixHeight][kMatrixWidth] = {};
uint8_t gBinsHistoryHead = 0;
uint8_t gLaunchpadPadLevels[64] = {0};
uint8_t gLaunchpadTopLevels[8] = {0};
uint8_t gLaunchpadSideLevels[8] = {0};
uint8_t gLastBinsStyleId = 0xFFu;
uint16_t gMatrixShadowFrames[kMatrixShadowBufferCount][kMatrixPixelCount] = {};
uint8_t gMatrixShadowBarHeights[kMatrixShadowBufferCount][kMatrixWidth] = {};
MatrixBufferMode gMatrixBufferModes[kMatrixShadowBufferCount] = {
    MatrixBufferMode::Unknown,
    MatrixBufferMode::Unknown};
uint8_t gMatrixShadowBackBufferIndex = 0;

struct PanelsBatchBuffer {
  String panelsSessionId;
  uint32_t batchSequence = 0;
  uint8_t* data = nullptr;
  size_t length = 0;
  uint16_t frameCount = 0;
  uint16_t durationMs = 0;
};

SemaphoreHandle_t gPanelsBatchMutex = nullptr;
TaskHandle_t gPanelsBatchTaskHandle = nullptr;
PanelsBatchBuffer gPanelsBatchPending = {};
String gPanelsBatchCurrentSessionId;
uint32_t gPanelsBatchCurrentSequence = 0;
bool gPanelsBatchCancelRequested = false;
bool gPanelsBatchUnderrun = false;
bool gAnimatedWebpBatchSupported = true;

enum class PendingOtaBootState : uint8_t {
  None = 0,
  PendingVerify = 1,
  ValidatedPendingReport = 2,
  RolledBackPendingReport = 3,
  FailedPendingReport = 4,
};

