eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
PendingOtaBootState gPendingOtaBootState = PendingOtaBootState::None;

struct FirmwareReleaseInfo;

void connectWebSocket();
void connectMqtt();
void handleControlCommandMessage(const JsonDocument& control);
void sendCommandProgress(
    const String& commandId,
    uint8_t progressPercent,
    const char* stage,
    const String& message,
    int successFlag = -1);
bool hasPendingOtaContext();
bool tryGetRunningOtaState(esp_ota_img_states_t& otaState);
bool isRunningAppPendingVerify();
void loadPendingOtaContext();
void clearPendingOtaContext();
bool persistPendingOtaContext(const String& commandId, const String& sourceVersion, const String& targetVersion);
void initializePendingOtaBootState();
void processPendingOtaSafeUpdate();
void publishPendingOtaReportIfNeeded();
void requestPendingOtaRollbackAndReboot(const char* errorCode, const String& errorMessage);
bool tryFetchLatestFirmwareRelease(FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage);
bool performFirmwareOta(const FirmwareReleaseInfo& info, const String& commandId, String& errorCode, String& errorMessage);
bool publishPresence(const char* state);
void otaDownloadTaskFn(void* parameter);
void processOtaProgressBridge();
void drawOtaProgressScreen(uint8_t percent, const char* stage);
void initializePanelsBatchRuntime();
bool beginHttpWithDeviceAuthUrl(HTTPClient& http, const String& url);
bool tryParseUnsignedLongParameter(JsonVariantConst value, uint32_t& output);
void clearPanelsBatchBuffer(PanelsBatchBuffer& buffer);
void movePanelsBatchBuffer(PanelsBatchBuffer& source, PanelsBatchBuffer& destination);
void cancelPanelsBatchPlayback();
bool tryQueuePanelsBatchForPlayback(PanelsBatchBuffer& batch, String& errorCode, String& errorMessage);
bool tryDownloadPanelsBatch(
    const String& downloadUrl,
    const String& expectedSha256,
    size_t expectedSize,
    const String& expectedContentType,
    PanelsBatchBuffer& batch,
    String& errorCode,
    String& errorMessage);
bool validatePanelsBatchWebp(
    const PanelsBatchBuffer& batch,
    String& errorCode,
    String& errorMessage);
void panelsBatchPlaybackTask(void* parameter);
bool tryPresentWebpRgbaFrame(const uint8_t* rgbaPixels, size_t rgbaLength);
bool waitForPanelsBatchTimestampUs(int64_t batchStartedUs, int timestampMs);
void markMatrixFrameDirty(bool countAsAppliedFrame);

#if defined(MICA_PROFILE_DMA_EXP)
MatrixPanel_I2S_DMA* gMatrix = nullptr;
#if MICA_HUB75_SHIFT_DRIVER == 1
constexpr HUB75_I2S_CFG::shift_driver kHub75BaselineDriver = HUB75_I2S_CFG::FM6124;
#else
constexpr HUB75_I2S_CFG::shift_driver kHub75BaselineDriver = HUB75_I2S_CFG::SHIFTREG;
#endif
#endif

struct RgbColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

struct FirmwareReleaseInfo {
  String firmwareVersion;
  String boardModel;
  String panelType;
  String profile;
  String controlPlane;
  String sha256;
  uint32_t fileSizeBytes = 0;
  String downloadPath;
};

struct OtaTaskParams {
  String downloadPath;
  String sha256;
  uint32_t fileSizeBytes;
  String commandId;
  String sourceVersion;
  String firmwareVersion;
};

constexpr uint32_t ceilDivideU32(uint32_t numerator, uint32_t denominator) {
  return denominator == 0 ? 0u : (numerator + denominator - 1u) / denominator;
}

const char* hub75FallbackStateName(Hub75FallbackState state) {
  switch (state) {
    case Hub75FallbackState::NoWifi:
      return "no_wifi";
    case Hub75FallbackState::NoServer:
      return "no_server";
    case Hub75FallbackState::Portal:
      return "portal";
    case Hub75FallbackState::Updating:
      return "updating";
    case Hub75FallbackState::None:
    default:
      return "none";
  }
}

size_t matrixPixelIndex(uint8_t x, uint8_t y) {
  return static_cast<size_t>(y) * static_cast<size_t>(kMatrixWidth) + static_cast<size_t>(x);
}

uint16_t rgb888ToRgb565(uint8_t r, uint8_t g, uint8_t b) {
  return static_cast<uint16_t>(((r & 0xF8u) << 8) | ((g & 0xFCu) << 3) | (b >> 3));
}

bool commitMatrixFrame();

void initializeColorConversionLookups() {
  for (uint8_t value = 0; value < 32; value++) {
    gRgb5To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 15u) / 31u);
  }

  for (uint8_t value = 0; value < 64; value++) {
    gRgb6To8Lut[value] = static_cast<uint8_t>((static_cast<uint16_t>(value) * 255u + 31u) / 63u);
  }
}

void clearMatrixShadowBuffer(uint8_t bufferIndex) {
  if (bufferIndex >= kMatrixShadowBufferCount) {
    return;
  }

  memset(gMatrixShadowFrames[bufferIndex], 0, sizeof(gMatrixShadowFrames[bufferIndex]));
  memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Clear;
}

void resetMatrixShadowState() {
  for (uint8_t bufferIndex = 0; bufferIndex < kMatrixShadowBufferCount; bufferIndex++) {
    clearMatrixShadowBuffer(bufferIndex);
  }

  gMatrixShadowBackBufferIndex = 0;
}

void setMatrixShadowPixel(uint8_t x, uint8_t y, uint16_t rgb565) {
  if (x >= kMatrixWidth || y >= kMatrixHeight) {
    return;
  }

  gMatrixShadowFrames[gMatrixShadowBackBufferIndex][matrixPixelIndex(x, y)] = rgb565;
}

void fillMatrixShadowRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t rgb565) {
  if (w <= 0 || h <= 0) {
    return;
  }

  const int16_t xStart = x < 0 ? 0 : x;
  const int16_t yStart = y < 0 ? 0 : y;
  const int16_t xEnd = (x + w) > static_cast<int16_t>(kMatrixWidth) ? static_cast<int16_t>(kMatrixWidth) : static_cast<int16_t>(x + w);
  const int16_t yEnd = (y + h) > static_cast<int16_t>(kMatrixHeight) ? static_cast<int16_t>(kMatrixHeight) : static_cast<int16_t>(y + h);
  if (xStart >= xEnd || yStart >= yEnd) {
    return;
  }

  for (int16_t row = yStart; row < yEnd; row++) {
    uint16_t* shadowRow =
        gMatrixShadowFrames[gMatrixShadowBackBufferIndex] + (static_cast<size_t>(row) * static_cast<size_t>(kMatrixWidth));
    for (int16_t column = xStart; column < xEnd; column++) {
      shadowRow[column] = rgb565;
    }
  }
}

bool hasPendingOtaContext() {
  return gPendingOtaCommandId.length() > 0
      && gPendingOtaSourceVersion.length() > 0
      && gPendingOtaTargetVersion.length() > 0;
}

bool tryGetRunningOtaState(esp_ota_img_states_t& otaState) {
  const esp_partition_t* runningPartition = esp_ota_get_running_partition();
  if (runningPartition == nullptr) {
    return false;
  }

  return esp_ota_get_state_partition(runningPartition, &otaState) == ESP_OK;
}

bool isRunningAppPendingVerify() {
  esp_ota_img_states_t otaState = ESP_OTA_IMG_UNDEFINED;
  return tryGetRunningOtaState(otaState) && otaState == ESP_OTA_IMG_PENDING_VERIFY;
}

void loadPendingOtaContext() {
  gPendingOtaCommandId = gPrefs.getString(kPrefsOtaCommandId, "");
  gPendingOtaSourceVersion = gPrefs.getString(kPrefsOtaSourceVersion, "");
  gPendingOtaTargetVersion = gPrefs.getString(kPrefsOtaTargetVersion, "");
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
}

void clearPendingOtaContext() {
  gPrefs.remove(kPrefsOtaCommandId);
  gPrefs.remove(kPrefsOtaSourceVersion);
  gPrefs.remove(kPrefsOtaTargetVersion);

  gPendingOtaCommandId = "";
  gPendingOtaSourceVersion = "";
  gPendingOtaTargetVersion = "";
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
}

bool persistPendingOtaContext(const String& commandId, const String& sourceVersion, const String& targetVersion) {
  if (commandId.isEmpty() || sourceVersion.isEmpty() || targetVersion.isEmpty()) {
    return false;
  }

  const size_t commandWritten = gPrefs.putString(kPrefsOtaCommandId, commandId);
  const size_t sourceWritten = gPrefs.putString(kPrefsOtaSourceVersion, sourceVersion);
  const size_t targetWritten = gPrefs.putString(kPrefsOtaTargetVersion, targetVersion);
  if (commandWritten == 0u || sourceWritten == 0u || targetWritten == 0u) {
    return false;
  }

  gPendingOtaCommandId = commandId;
  gPendingOtaSourceVersion = sourceVersion;
  gPendingOtaTargetVersion = targetVersion;
  gPendingOtaFailureCode = "";
  gPendingOtaFailureMessage = "";
  gPendingOtaValidationStartedMs = 0;
  gPendingOtaPendingVerifyAnnounced = false;
  gPendingOtaBootState = PendingOtaBootState::None;
  return true;
}

void initializePendingOtaBootState() {
  if (!hasPendingOtaContext()) {
    return;
  }

  if (String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaTargetVersion)) {
    esp_ota_img_states_t otaState = ESP_OTA_IMG_UNDEFINED;
    if (tryGetRunningOtaState(otaState) && otaState == ESP_OTA_IMG_PENDING_VERIFY) {
      gPendingOtaBootState = PendingOtaBootState::PendingVerify;
      gPendingOtaValidationStartedMs = millis();
      Serial.printf("[ota] safe update pendente de validacao. target=%s\n", gPendingOtaTargetVersion.c_str());
      return;
    }

    gPendingOtaBootState = PendingOtaBootState::ValidatedPendingReport;
    Serial.printf("[ota] firmware OTA ativo e aguardando confirmacao tracked. target=%s\n", gPendingOtaTargetVersion.c_str());
    return;
  }

  if (String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaSourceVersion)) {
    gPendingOtaBootState = PendingOtaBootState::RolledBackPendingReport;
    gPendingOtaFailureCode = "ota_rolled_back";
    gPendingOtaFailureMessage = String("Rollback automatico concluido; firmware atual voltou para ") + kFirmwareVersion + ".";
    Serial.printf("[ota] rollback automatico detectado. source=%s target=%s\n",
        gPendingOtaSourceVersion.c_str(),
        gPendingOtaTargetVersion.c_str());
    return;
  }

  gPendingOtaBootState = PendingOtaBootState::FailedPendingReport;
  gPendingOtaFailureCode = "ota_context_mismatch";
  gPendingOtaFailureMessage = String("Contexto OTA inconsistente para firmware atual ") + kFirmwareVersion + ".";
  Serial.printf("[ota] contexto OTA inconsistente. current=%s source=%s target=%s\n",
      kFirmwareVersion,
      gPendingOtaSourceVersion.c_str(),
      gPendingOtaTargetVersion.c_str());
}

RgbColor rainbowColorForColumn(uint16_t column, uint16_t columnCount) {
  if (columnCount <= 1) {
    return {255, 0, 0};
  }

  const uint8_t hue = static_cast<uint8_t>((column * 255u) / (columnCount - 1u));
  const uint8_t region = hue / 43u;
  const uint8_t remainder = static_cast<uint8_t>((hue - (region * 43u)) * 6u);
  const uint8_t q = static_cast<uint8_t>(255u - remainder);
  const uint8_t t = remainder;

  switch (region) {
    case 0:
      return {255, t, 0};
    case 1:
      return {q, 255, 0};
    case 2:
      return {0, 255, t};
    case 3:
      return {0, q, 255};
    case 4:
      return {t, 0, 255};
    default:
      return {255, 0, q};
  }
}

RgbColor rgb565ToRgb888(uint16_t rgb565) {
  return {
      gRgb5To8Lut[(rgb565 >> 11) & 0x1Fu],
      gRgb6To8Lut[(rgb565 >> 5) & 0x3Fu],
      gRgb5To8Lut[rgb565 & 0x1Fu]};
}

float clamp01f(float value) {
  if (value <= 0.0f) {
    return 0.0f;
  }

  return value >= 1.0f ? 1.0f : value;
}

uint8_t clampToByte(int value) {
  if (value <= 0) {
    return 0;
  }

  return value >= 255 ? 255 : static_cast<uint8_t>(value);
}

RgbColor scaleColor(const RgbColor& color, float amount) {
  const float scale = clamp01f(amount);
  return {
      clampToByte(static_cast<int>(roundf(color.r * scale))),
      clampToByte(static_cast<int>(roundf(color.g * scale))),
      clampToByte(static_cast<int>(roundf(color.b * scale)))};
}

RgbColor mixColor(const RgbColor& left, const RgbColor& right, float amount) {
  const float t = clamp01f(amount);
  return {
      clampToByte(static_cast<int>(roundf(left.r + ((right.r - left.r) * t)))),
      clampToByte(static_cast<int>(roundf(left.g + ((right.g - left.g) * t)))),
      clampToByte(static_cast<int>(roundf(left.b + ((right.b - left.b) * t))))};
}

RgbColor sampleGradientStops(const RgbColor* stops, size_t stopCount, float t) {
  if (stops == nullptr || stopCount == 0) {
    return {255, 255, 255};
  }

  if (stopCount == 1) {
    return stops[0];
  }

  const float clamped = clamp01f(t);
  const float scaled = clamped * static_cast<float>(stopCount - 1u);
  const size_t leftIndex = static_cast<size_t>(scaled);
  const size_t rightIndex = leftIndex + 1u >= stopCount ? stopCount - 1u : leftIndex + 1u;
  return mixColor(stops[leftIndex], stops[rightIndex], scaled - static_cast<float>(leftIndex));
}

Hub75BinsVisualStyle decodeBinsVisualStyle(uint8_t flags) {
  switch (flags >> 3u) {
    case 1u:
      return Hub75BinsVisualStyle::WaveMirror;
    case 2u:
      return Hub75BinsVisualStyle::MirrorLines;
    case 3u:
      return Hub75BinsVisualStyle::MirrorBlocks;
    case 4u:
      return Hub75BinsVisualStyle::ClassicBars;
    case 5u:
      return Hub75BinsVisualStyle::FlowLine;
    case 6u:
      return Hub75BinsVisualStyle::HistoryScan;
    case 7u:
      return Hub75BinsVisualStyle::RadialOrbit;
    case 8u:
      return Hub75BinsVisualStyle::Atmosphere;
    case 9u:
      return Hub75BinsVisualStyle::LaunchpadGrid;
    default:
      return Hub75BinsVisualStyle::LegacyFallback;
  }
}

Hub75BinsPaletteFamily decodeBinsPaletteFamily(uint8_t flags) {
  switch (flags & 0x07u) {
    case 1u:
      return Hub75BinsPaletteFamily::Rainbow;
    case 2u:
      return Hub75BinsPaletteFamily::Sunset;
    case 3u:
      return Hub75BinsPaletteFamily::Arctic;
    case 4u:
      return Hub75BinsPaletteFamily::Neon;
    case 5u:
      return Hub75BinsPaletteFamily::Aurora;
    case 6u:
      return Hub75BinsPaletteFamily::Plasma;
    case 7u:
      return Hub75BinsPaletteFamily::Mono;
    default:
      return Hub75BinsPaletteFamily::Canonical;
  }
}

Hub75BinsPaletteFamily resolveBinsEffectivePalette(Hub75BinsVisualStyle style, Hub75BinsPaletteFamily requestedPalette) {
  if (requestedPalette != Hub75BinsPaletteFamily::Canonical) {
    return requestedPalette;
  }

  switch (style) {
    case Hub75BinsVisualStyle::WaveMirror:
      return Hub75BinsPaletteFamily::Rainbow;
    case Hub75BinsVisualStyle::RadialOrbit:
      return Hub75BinsPaletteFamily::Mono;
    case Hub75BinsVisualStyle::Atmosphere:
      return Hub75BinsPaletteFamily::Aurora;
    case Hub75BinsVisualStyle::LaunchpadGrid:
      return Hub75BinsPaletteFamily::Canonical;
    default:
      return Hub75BinsPaletteFamily::Rainbow;
  }
}

