eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
RgbColor samplePaletteColor(Hub75BinsPaletteFamily palette, float t) {
  static constexpr RgbColor kSunsetStops[] = {
      {255, 72, 40},
      {255, 132, 32},
      {255, 188, 48},
      {220, 82, 196},
      {98, 54, 255}};
  static constexpr RgbColor kArcticStops[] = {
      {24, 214, 255},
      {0, 168, 255},
      {74, 224, 255},
      {138, 255, 214},
      {114, 92, 255}};
  static constexpr RgbColor kNeonStops[] = {
      {57, 255, 20},
      {0, 255, 180},
      {0, 220, 255},
      {120, 86, 255},
      {255, 60, 180}};
  static constexpr RgbColor kAuroraStops[] = {
      {48, 255, 170},
      {0, 222, 255},
      {88, 124, 255},
      {198, 84, 255},
      {255, 176, 226}};
  static constexpr RgbColor kPlasmaStops[] = {
      {255, 88, 46},
      {255, 168, 26},
      {255, 58, 168},
      {64, 108, 255},
      {72, 244, 255}};
  static constexpr RgbColor kMonoStops[] = {
      {88, 98, 118},
      {180, 192, 214},
      {255, 255, 255}};

  switch (palette) {
    case Hub75BinsPaletteFamily::Sunset:
      return sampleGradientStops(kSunsetStops, sizeof(kSunsetStops) / sizeof(kSunsetStops[0]), t);
    case Hub75BinsPaletteFamily::Arctic:
      return sampleGradientStops(kArcticStops, sizeof(kArcticStops) / sizeof(kArcticStops[0]), t);
    case Hub75BinsPaletteFamily::Neon:
      return sampleGradientStops(kNeonStops, sizeof(kNeonStops) / sizeof(kNeonStops[0]), t);
    case Hub75BinsPaletteFamily::Aurora:
      return sampleGradientStops(kAuroraStops, sizeof(kAuroraStops) / sizeof(kAuroraStops[0]), t);
    case Hub75BinsPaletteFamily::Plasma:
      return sampleGradientStops(kPlasmaStops, sizeof(kPlasmaStops) / sizeof(kPlasmaStops[0]), t);
    case Hub75BinsPaletteFamily::Mono:
      return sampleGradientStops(kMonoStops, sizeof(kMonoStops) / sizeof(kMonoStops[0]), t);
    case Hub75BinsPaletteFamily::Canonical:
      return {255, 255, 255};
    case Hub75BinsPaletteFamily::Rainbow:
    default:
      return rainbowColorForColumn(
          static_cast<uint16_t>(clampToByte(static_cast<int>(roundf(clamp01f(t) * 255.0f)))),
          256);
  }
}

uint8_t smoothBinsSample(const uint8_t* bins, int index) {
  const int clampedIndex = index < 0 ? 0 : (index >= kBinsCount ? kBinsCount - 1 : index);
  const int leftIndex = clampedIndex > 0 ? clampedIndex - 1 : clampedIndex;
  const int rightIndex = clampedIndex + 1 < kBinsCount ? clampedIndex + 1 : clampedIndex;
  const int smoothed =
      static_cast<int>(bins[leftIndex]) + (static_cast<int>(bins[clampedIndex]) * 2) + static_cast<int>(bins[rightIndex]);
  return static_cast<uint8_t>(smoothed / 4);
}

uint8_t amplitudeToHeight(uint8_t amplitude, uint8_t maxHeight) {
  return static_cast<uint8_t>((static_cast<uint16_t>(amplitude) * maxHeight + 254u) / 255u);
}

uint8_t sampleBinsAverage(const uint8_t* bins, uint16_t startInclusive, uint16_t endExclusive) {
  if (startInclusive >= endExclusive || startInclusive >= kBinsCount) {
    return 0;
  }

  const uint16_t safeEnd = endExclusive > kBinsCount ? kBinsCount : endExclusive;
  uint32_t sum = 0;
  for (uint16_t index = startInclusive; index < safeEnd; index++) {
    sum += bins[index];
  }

  return static_cast<uint8_t>(sum / static_cast<uint32_t>(safeEnd - startInclusive));
}

void resetBinsVisualState() {
  memset(gBinsPeakHeights, 0, sizeof(gBinsPeakHeights));
  memset(gBinsHistory, 0, sizeof(gBinsHistory));
  gBinsHistoryHead = 0;
  memset(gLaunchpadPadLevels, 0, sizeof(gLaunchpadPadLevels));
  memset(gLaunchpadTopLevels, 0, sizeof(gLaunchpadTopLevels));
  memset(gLaunchpadSideLevels, 0, sizeof(gLaunchpadSideLevels));
  for (uint8_t bufferIndex = 0; bufferIndex < kMatrixShadowBufferCount; bufferIndex++) {
    memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
    if (gMatrixBufferModes[bufferIndex] == MatrixBufferMode::Bars) {
      gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Unknown;
    }
  }
}

bool finishBinsVisualFrame() {
  gMatrixBufferModes[gMatrixShadowBackBufferIndex] = MatrixBufferMode::Bars;
  return commitMatrixFrame();
}

bool isReservedHub75Pin(int pin) {
  for (uint8_t gpio : kMatrixRgbPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  for (uint8_t gpio : kMatrixAddrPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  return pin == static_cast<int>(kMatrixClockPin)
      || pin == static_cast<int>(kMatrixLatchPin)
      || pin == static_cast<int>(kMatrixOePin);
}

bool tryValidateAuxLedPin(int pin, String& reason) {
  if (pin < 0) {
    reason = "desabilitado por build flag";
    return false;
  }

  if (pin >= static_cast<int>(SOC_GPIO_PIN_COUNT)) {
    reason = "fora da faixa de GPIO fisico";
    return false;
  }

  if (isReservedHub75Pin(pin)) {
    reason = "conflito com pinos HUB75";
    return false;
  }

  if (pin == static_cast<int>(kSerialRxPin) || pin == static_cast<int>(kSerialTxPin)) {
    reason = "conflito com serial";
    return false;
  }

  return true;
}

void logConnectivityState(const char* eventOverride = nullptr) {
  const char* eventName = (eventOverride != nullptr && eventOverride[0] != '\0')
      ? eventOverride
      : gLastWifiEvent.c_str();

  Serial.printf("[conn] wifiState=%s portal=%s event=%s\n",
      gWifiState.c_str(),
      gProvisioningPortalActive ? "on" : "off",
      eventName);
}

bool publishDeviceLog(
    const char* level,
    const char* category,
    const char* eventCode,
    const String& message,
    bool includeTelemetrySequence = true);

bool publishDeviceLog(
    const char* level,
    const char* category,
    const char* eventCode,
    const char* message,
    bool includeTelemetrySequence = true) {
  return publishDeviceLog(
      level,
      category,
      eventCode,
      String(message == nullptr ? "" : message),
      includeTelemetrySequence);
}

void publishConnectivityLog(const char* wifiState, const char* lastEvent, bool changedOrForced) {
  if (!changedOrForced || lastEvent == nullptr || lastEvent[0] == '\0') {
    return;
  }

  const char* category = "wifi";
  String message;
  if (strncmp(lastEvent, "portal_", 7) == 0) {
    category = "portal";
    message = String("Portal de provisioning: ") + (gProvisioningPortalActive ? "ativo" : "inativo");
  } else if (strncmp(lastEvent, "ws_", 3) == 0) {
    category = "ws";
    message = String("Sessao websocket: ") + lastEvent;
  } else if (strncmp(lastEvent, "mqtt_", 5) == 0) {
    category = "mqtt";
    message = String("Controle MQTT: ") + lastEvent;
  } else {
    message = String("Wi-Fi state=") + (wifiState == nullptr ? gWifiState : wifiState) + " event=" + lastEvent;
  }

  (void)publishDeviceLog("info", category, lastEvent, message, false);
}

void flushWsFlapDiagnostics(bool force = false) {
  if (gWsFlapWindowStartMs == 0) {
    return;
  }

  const unsigned long now = millis();
  const unsigned long elapsed = now - gWsFlapWindowStartMs;
  if (!force && elapsed < kWsFlapReportWindowMs) {
    return;
  }

  if (gWsDisconnectCountInWindow >= kWsFlapReportThreshold) {
    Serial.printf(
        "[ws_diag] window_ms=%lu connects=%u disconnects=%u reconnect_interval_ms=%lu state=flapping\n",
        elapsed,
        gWsConnectCountInWindow,
        gWsDisconnectCountInWindow,
        kWsAutoReconnectIntervalMs);
    (void)publishDeviceLog(
        "warning",
        "ws",
        "flapping",
        String("WS flapping detectado: connects=") + gWsConnectCountInWindow
            + " disconnects=" + gWsDisconnectCountInWindow,
        false);
  }

  gWsFlapWindowStartMs = now;
  gWsConnectCountInWindow = 0;
  gWsDisconnectCountInWindow = 0;
}

void registerWsConnectivitySample(bool connected) {
  if (gWsFlapWindowStartMs == 0) {
    gWsFlapWindowStartMs = millis();
  } else {
    flushWsFlapDiagnostics(false);
  }

  if (connected) {
    gWsConnectCountInWindow++;
  } else {
    gWsDisconnectCountInWindow++;
  }
}

void setConnectivityState(const char* wifiState, const char* lastEvent, bool forceLog = false, bool publishEvent = true) {
  bool changed = false;
  if (wifiState != nullptr && wifiState[0] != '\0' && !gWifiState.equals(wifiState)) {
    gWifiState = wifiState;
    changed = true;
  }

  if (publishEvent && lastEvent != nullptr && lastEvent[0] != '\0' && !gLastWifiEvent.equals(lastEvent)) {
    gLastWifiEvent = lastEvent;
    changed = true;
  }

  if (changed || forceLog) {
    logConnectivityState(publishEvent ? nullptr : lastEvent);
    publishConnectivityLog(
        wifiState != nullptr && wifiState[0] != '\0' ? wifiState : gWifiState.c_str(),
        lastEvent,
        true);
  }
}

void setProvisioningPortalActive(bool active, const char* eventName) {
  if (gProvisioningPortalActive == active && (eventName == nullptr || eventName[0] == '\0')) {
    return;
  }

  gProvisioningPortalActive = active;
  setConnectivityState(active ? kWifiStatePortal : kWifiStateConnected, eventName, true);
}

