eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  gOtaProgressPercent = percent;
  gOtaProgressStage = stage;

  clearMatrix();

  const uint16_t accentColor = rgb888ToRgb565(48, 160, 255);
  const uint16_t titleColor = rgb888ToRgb565(244, 244, 244);
  const uint16_t subtitleColor = rgb888ToRgb565(158, 170, 180);
  const uint16_t barBgColor = rgb888ToRgb565(36, 48, 60);

  drawMatrixTextCentered("ATUALIZANDO", 14, titleColor, 1);
  gMatrix->drawFastHLine(24, 20, kMatrixWidth - 48, rgb888ToRgb565(56, 68, 80));

  constexpr int16_t barX = 10;
  constexpr int16_t barY = 28;
  constexpr int16_t barWidth = kMatrixWidth - 20;
  constexpr int16_t barHeight = 8;
  gMatrix->fillRect(barX, barY, barWidth, barHeight, barBgColor);
  gMatrix->drawRect(barX, barY, barWidth, barHeight, rgb888ToRgb565(56, 68, 80));

  const int16_t fillWidth = static_cast<int16_t>((static_cast<uint32_t>(percent) * static_cast<uint32_t>(barWidth - 2)) / 100u);
  if (fillWidth > 0) {
    gMatrix->fillRect(barX + 1, barY + 1, fillWidth, barHeight - 2, accentColor);
  }

  char percentText[8];
  snprintf(percentText, sizeof(percentText), "%u%%", static_cast<unsigned>(percent));
  drawMatrixTextCentered(percentText, 48, titleColor, 1);

  if (stage != nullptr && stage[0] != '\0') {
    drawMatrixTextCentered(stage, 58, subtitleColor, 1);
  }

  gMatrixBufferModes[gMatrixShadowBackBufferIndex] = MatrixBufferMode::Clear;
  commitMatrixFrame();
}
#endif

Hub75FallbackState resolveHub75FallbackCandidate() {
  if (gOtaInProgress) {
    return Hub75FallbackState::Updating;
  }

  if (gProvisioningPortalActive) {
    return Hub75FallbackState::Portal;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return Hub75FallbackState::NoWifi;
  }

  if (!gWs.isConnected()) {
    return Hub75FallbackState::NoServer;
  }

  return Hub75FallbackState::None;
}

Hub75FallbackState resolveHub75FallbackState(unsigned long nowMs) {
  const Hub75FallbackState candidate = resolveHub75FallbackCandidate();
  if (candidate == Hub75FallbackState::None || candidate == Hub75FallbackState::Portal) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = 0;
    return candidate;
  }

  if (candidate == gHub75FallbackState) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = 0;
    return candidate;
  }

  if (candidate != gHub75FallbackPendingState) {
    gHub75FallbackPendingState = candidate;
    gHub75FallbackPendingSinceMs = nowMs;
    return Hub75FallbackState::None;
  }

  if (gHub75FallbackPendingSinceMs != 0
      && (nowMs - gHub75FallbackPendingSinceMs) >= kConnectivityFallbackDebounceMs) {
    return candidate;
  }

  return Hub75FallbackState::None;
}

void updateHub75FallbackState(unsigned long nowMs) {
  const Hub75FallbackState nextState = resolveHub75FallbackState(nowMs);
  if (nextState == gHub75FallbackState) {
    return;
  }

  const Hub75FallbackState previousState = gHub75FallbackState;
  gHub75FallbackState = nextState;
  gHub75FallbackDirty = nextState != Hub75FallbackState::None;
  gHub75FallbackClearPending = previousState != Hub75FallbackState::None && nextState == Hub75FallbackState::None;
  if (nextState != Hub75FallbackState::None) {
    gHub75FallbackClearPending = false;
  }

  Serial.printf(
      "[hub75_fallback] previous=%s next=%s\n",
      hub75FallbackStateName(previousState),
      hub75FallbackStateName(nextState));
}

bool clearConnectivityFallbackFrame() {
  if (!gMatrixReady) {
    return false;
  }

  clearMatrix();
  return commitMatrixFrame();
}

bool drawConnectivityFallback(Hub75FallbackState state) {
  if (!gMatrixReady || state == Hub75FallbackState::None) {
    return false;
  }

  const char* title = "";
  const char* subtitle = "";
  RgbColor accent = {0, 0, 0};
  switch (state) {
    case Hub75FallbackState::NoWifi:
      title = "SEM WIFI";
      subtitle = "Conecte a rede";
      accent = {255, 170, 48};
      break;
    case Hub75FallbackState::NoServer:
      title = "SEM SERV";
      subtitle = "Abra o MicaAudio";
      accent = {255, 96, 96};
      break;
    case Hub75FallbackState::Portal:
      title = "SETUP WIFI";
      subtitle = "Conecte no portal";
      accent = {96, 220, 255};
      break;
    case Hub75FallbackState::Updating:
#if defined(MICA_PROFILE_DMA_EXP)
      drawOtaProgressScreen(gOtaProgressPercent, gOtaProgressStage);
      return true;
#else
      return false;
#endif
    case Hub75FallbackState::None:
    default:
      return false;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  clearMatrix();
  const uint16_t accentColor = rgb888ToRgb565(accent.r, accent.g, accent.b);
  const uint16_t titleColor = rgb888ToRgb565(244, 244, 244);
  const uint16_t subtitleColor = rgb888ToRgb565(158, 170, 180);
  drawConnectivityFallbackIcon(state, accentColor, titleColor);
  gMatrix->drawFastHLine(24, 22, kMatrixWidth - 48, rgb888ToRgb565(36, 48, 60));
  drawMatrixTextCentered(title, 36, titleColor, 2);
  drawMatrixTextCentered(subtitle, 50, subtitleColor, 1);
  gMatrixBufferModes[gMatrixShadowBackBufferIndex] = MatrixBufferMode::Clear;
  return commitMatrixFrame();
#else
  return false;
#endif
}

bool commitMatrixFrame() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
#if CORE_DEBUG_LEVEL >= 3
    configASSERT(xPortGetCoreID() == 1);
#endif
    gMatrix->flipDMABuffer();
    gLastMatrixPresentUs = micros();
    gHub75PresentFrames++;
    gMatrixShadowBackBufferIndex ^= 1u;
    return true;
  }
#endif

  return false;
}

uint32_t getPhysicalPresentIntervalUs() {
#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr && gMatrix->calculated_refresh_rate > 0) {
    const uint32_t refreshRate = static_cast<uint32_t>(gMatrix->calculated_refresh_rate);
    const uint32_t intervalUs = ceilDivideU32(kMicrosPerSecond, refreshRate);
    return intervalUs == 0 ? 1u : intervalUs;
  }
#endif

  return kHub75FallbackPresentIntervalUs;
}

uint32_t getEffectiveMatrixPresentIntervalUs() {
  const uint32_t physicalPresentIntervalUs = getPhysicalPresentIntervalUs();
  return physicalPresentIntervalUs > kHub75TargetPresentIntervalUs
      ? physicalPresentIntervalUs
      : kHub75TargetPresentIntervalUs;
}

