eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
bool shouldPresentMatrixFrame(uint32_t nowUs) {
  return gLastMatrixPresentUs == 0
      || static_cast<uint32_t>(nowUs - gLastMatrixPresentUs) >= getEffectiveMatrixPresentIntervalUs();
}

void markMatrixFrameDirty(bool countAsAppliedFrame) {
  gMatrixFrameDirty = true;
  if (countAsAppliedFrame) {
    gPendingMatrixPresentCountsAsApplied = true;
  }
}

#if defined(MICA_PROFILE_DMA_EXP)
const char* hub75DriverName(HUB75_I2S_CFG::shift_driver driver) {
  switch (driver) {
    case HUB75_I2S_CFG::SHIFTREG:
      return "SHIFTREG";
    case HUB75_I2S_CFG::FM6124:
      return "FM6124";
    case HUB75_I2S_CFG::FM6126A:
      return "FM6126A";
    case HUB75_I2S_CFG::ICN2038S:
      return "ICN2038S";
    case HUB75_I2S_CFG::MBI5124:
      return "MBI5124";
    default:
      return "UNKNOWN";
  }
}
#endif

bool validateMatrixPinConfiguration() {
  if (kMatrixHeight < 64) {
    return true;
  }

  const int ePin = static_cast<int>(kMatrixAddrPins[4]);
  if (ePin < 0) {
    Serial.println("Pinout HUB75 invalido: painel 128x64 exige linha E.");
    return false;
  }

  if (ePin == static_cast<int>(kMatrixClockPin)
      || ePin == static_cast<int>(kMatrixLatchPin)
      || ePin == static_cast<int>(kMatrixOePin)) {
    Serial.printf(
        "Pinout HUB75 invalido: linha E=%d conflita com CLK/LAT/OE.\n",
        ePin);
    return false;
  }

  return true;
}

void logMatrixPinout() {
  Serial.printf(
      "HUB75 pinout RGB={%u,%u,%u,%u,%u,%u} ADDR={%u,%u,%u,%u,%u} LAT=%u OE=%u CLK=%u\n",
      static_cast<unsigned>(kMatrixRgbPins[0]),
      static_cast<unsigned>(kMatrixRgbPins[1]),
      static_cast<unsigned>(kMatrixRgbPins[2]),
      static_cast<unsigned>(kMatrixRgbPins[3]),
      static_cast<unsigned>(kMatrixRgbPins[4]),
      static_cast<unsigned>(kMatrixRgbPins[5]),
      static_cast<unsigned>(kMatrixAddrPins[0]),
      static_cast<unsigned>(kMatrixAddrPins[1]),
      static_cast<unsigned>(kMatrixAddrPins[2]),
      static_cast<unsigned>(kMatrixAddrPins[3]),
      static_cast<unsigned>(kMatrixAddrPins[4]),
      static_cast<unsigned>(kMatrixLatchPin),
      static_cast<unsigned>(kMatrixOePin),
      static_cast<unsigned>(kMatrixClockPin));
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#pontos-de-alteracao-frequente
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-128x64-single-canvas-mapping
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-anti-flicker-com-double-buffer
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-upstream-baseline-fluidity-recovery
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-60-fps-com-pacing-fisico-correto
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#atualizacao-2026-03---hub75-diagnostic-matrix-envs
bool initMatrixDisplay() {

#if defined(MICA_PROFILE_DMA_EXP)
  if (!validateMatrixPinConfiguration()) {
    return false;
  }

  logMatrixPinout();

  HUB75_I2S_CFG::i2s_pins pinMap = {
      static_cast<int8_t>(kMatrixRgbPins[0]),
      static_cast<int8_t>(kMatrixRgbPins[1]),
      static_cast<int8_t>(kMatrixRgbPins[2]),
      static_cast<int8_t>(kMatrixRgbPins[3]),
      static_cast<int8_t>(kMatrixRgbPins[4]),
      static_cast<int8_t>(kMatrixRgbPins[5]),
      static_cast<int8_t>(kMatrixAddrPins[0]),
      static_cast<int8_t>(kMatrixAddrPins[1]),
      static_cast<int8_t>(kMatrixAddrPins[2]),
      static_cast<int8_t>(kMatrixAddrPins[3]),
      static_cast<int8_t>(kMatrixAddrPins[4]),
      static_cast<int8_t>(kMatrixLatchPin),
      static_cast<int8_t>(kMatrixOePin),
      static_cast<int8_t>(kMatrixClockPin)};

  HUB75_I2S_CFG config(kMatrixWidth, kMatrixHeight, 1, pinMap);
  config.double_buff = true;
  config.i2sspeed = HUB75_I2S_CFG::HZ_10M;
  config.clkphase = kHub75ClockPhaseEnabled;
  config.driver = kHub75BaselineDriver;
  config.latch_blanking = kHub75LatchBlankingPulses;
  config.min_refresh_rate = kHub75MinRefreshRate;
  config.setPixelColorDepthBits(kHub75ColorDepthBits);
  Serial.printf(
      "[hub75] config matrix=%ux%u driver=%s color_depth=%u i2s=10MHz clkphase=%u double_buffer=%u latch_blanking=%u min_refresh_rate=%u\n",
      static_cast<unsigned>(kMatrixWidth),
      static_cast<unsigned>(kMatrixHeight),
      hub75DriverName(config.driver),
      static_cast<unsigned>(config.getPixelColorDepthBits()),
      config.clkphase ? 1u : 0u,
      config.double_buff ? 1u : 0u,
      static_cast<unsigned>(config.latch_blanking),
      static_cast<unsigned>(config.min_refresh_rate));

  gMatrix = new MatrixPanel_I2S_DMA(config);
  if (gMatrix == nullptr) {
    Serial.println("Falha ao alocar MatrixPanel_I2S_DMA.");
    return false;
  }

  if (!gMatrix->begin()) {
    Serial.println("Falha ao inicializar MatrixPanel_I2S_DMA.");
    delete gMatrix;
    gMatrix = nullptr;
    return false;
  }

  const uint8_t effectiveLatchBlanking = gMatrix->setLatBlanking(kHub75LatchBlankingPulses);
  Serial.printf(
      "[hub75] active driver=%s calculated_refresh_rate=%dHz latch_blanking=%u physical_present_interval_us=%lu target_present_interval_us=%lu effective_present_interval_us=%lu clkphase=%u double_buffer=%u min_refresh_rate=%u\n",
      hub75DriverName(config.driver),
      gMatrix->calculated_refresh_rate,
      static_cast<unsigned>(effectiveLatchBlanking),
      static_cast<unsigned long>(getPhysicalPresentIntervalUs()),
      static_cast<unsigned long>(kHub75TargetPresentIntervalUs),
      static_cast<unsigned long>(getEffectiveMatrixPresentIntervalUs()),
      config.clkphase ? 1u : 0u,
      config.double_buff ? 1u : 0u,
      static_cast<unsigned>(config.min_refresh_rate));
#if defined(MICA_HUB75_DIAGNOSTIC_MODE)
  Serial.println("[hub75] diagnostic_mode=1 oracle_compare=shiftreg_vs_fm6124");
#endif
#endif

  gMatrixReady = true;
  gAppliedBrightness = 0;
  resetMatrixShadowState();
  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  clearMatrix();
  (void)commitMatrixFrame();
  clearMatrix();
  (void)commitMatrixFrame();
  gLastMatrixPresentUs = 0;
  gHub75PresentFrames = 0;
  return true;
}

bool postJsonWithAuth(const String& path, JsonDocument& doc) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    return false;
  }

  HTTPClient http;
  String url = "http://" + gServerHost + ":" + String(gServerPort) + path;
  if (!http.begin(url)) {
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);

  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  http.end();

