eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  return code >= 200 && code < 300;
}

String normalizeLowerHex(const String& value) {
  String normalized = value;
  normalized.trim();
  normalized.toLowerCase();
  return normalized;
}

String bytesToLowerHex(const uint8_t* bytes, size_t length) {
  const char* hex = "0123456789abcdef";
  String result;
  result.reserve(length * 2u);
  for (size_t index = 0; index < length; index++) {
    const uint8_t value = bytes[index];
    result += hex[(value >> 4) & 0x0Fu];
    result += hex[value & 0x0Fu];
  }

  return result;
}

bool beginHttpWithDeviceAuth(HTTPClient& http, const String& path) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    return false;
  }

  String normalizedPath = path;
  if (!normalizedPath.startsWith("/")) {
    normalizedPath = "/" + normalizedPath;
  }

  String url = "http://" + gServerHost + ":" + String(gServerPort) + normalizedPath;
  if (!http.begin(url)) {
    return false;
  }

  http.setConnectTimeout(5000);
  http.setTimeout(15000);
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);
  return true;
}

bool beginHttpWithDeviceAuthUrl(HTTPClient& http, const String& url) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || url.isEmpty()) {
    return false;
  }

  if (!http.begin(url)) {
    return false;
  }

  http.setConnectTimeout(5000);
  http.setTimeout(15000);
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);
  static const char* kHeaderKeys[] = {"Content-Type"};
  http.collectHeaders(kHeaderKeys, 1);
  return true;
}

void clearPanelsBatchBuffer(PanelsBatchBuffer& buffer) {
  if (buffer.data != nullptr) {
    free(buffer.data);
    buffer.data = nullptr;
  }

  buffer.panelsSessionId = "";
  buffer.batchSequence = 0;
  buffer.length = 0;
  buffer.frameCount = 0;
  buffer.durationMs = 0;
}

void movePanelsBatchBuffer(PanelsBatchBuffer& source, PanelsBatchBuffer& destination) {
  if (&source == &destination) {
    return;
  }

  clearPanelsBatchBuffer(destination);
  destination.panelsSessionId = source.panelsSessionId;
  destination.batchSequence = source.batchSequence;
  destination.data = source.data;
  destination.length = source.length;
  destination.frameCount = source.frameCount;
  destination.durationMs = source.durationMs;

  source.panelsSessionId = "";
  source.batchSequence = 0;
  source.data = nullptr;
  source.length = 0;
  source.frameCount = 0;
  source.durationMs = 0;
}

void cancelPanelsBatchPlayback() {
  if (gPanelsBatchMutex == nullptr) {
    return;
  }

  if (xSemaphoreTake(gPanelsBatchMutex, portMAX_DELAY) != pdTRUE) {
    return;
  }

  gPanelsBatchCancelRequested = true;
  gPanelsBatchUnderrun = false;
  clearPanelsBatchBuffer(gPanelsBatchPending);
  xSemaphoreGive(gPanelsBatchMutex);
}

bool tryParseFirmwareReleaseInfo(const JsonDocument& document, FirmwareReleaseInfo& info) {
  const char* firmwareVersion = document["firmwareVersion"] | "";
  const char* boardModel = document["boardModel"] | "";
  const char* panelType = document["panelType"] | "";
  const char* profile = document["profile"] | "";
  const char* controlPlane = document["controlPlane"] | "";
  const char* sha256 = document["sha256"] | "";
  const char* downloadPath = document["downloadPath"] | "";
  const uint32_t fileSizeBytes = document["fileSizeBytes"] | 0u;

  if (firmwareVersion[0] == '\0'
      || boardModel[0] == '\0'
      || panelType[0] == '\0'
      || profile[0] == '\0'
      || controlPlane[0] == '\0'
      || sha256[0] == '\0'
      || downloadPath[0] == '\0'
      || fileSizeBytes == 0u) {
    return false;
  }

  info.firmwareVersion = firmwareVersion;
  info.boardModel = boardModel;
  info.panelType = panelType;
  info.profile = profile;
  info.controlPlane = controlPlane;
  info.sha256 = normalizeLowerHex(sha256);
  info.fileSizeBytes = fileSizeBytes;
  info.downloadPath = downloadPath;
  return true;
}

bool validateFirmwareReleaseInfo(const FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage) {
  if (!requestedVersion.isEmpty() && !info.firmwareVersion.equalsIgnoreCase(requestedVersion)) {
    errorCode = "firmware_version_mismatch";
    errorMessage = "Servidor retornou versao diferente da solicitada para OTA.";
    return false;
  }

  if (!info.boardModel.equalsIgnoreCase(kBoardModel)
      || !info.panelType.equalsIgnoreCase(kPanelType)
      || !info.profile.equalsIgnoreCase(kFirmwareProfile)) {
    errorCode = "firmware_incompatible";
    errorMessage = "Firmware oficial nao corresponde ao hardware/perfil deste dispositivo.";
    return false;
  }

  if (!info.controlPlane.equalsIgnoreCase("mqtt")) {
    errorCode = "firmware_control_plane_invalid";
    errorMessage = "Firmware oficial incompativel com o control plane atual.";
    return false;
  }

  if (info.sha256.length() != 64) {
    errorCode = "firmware_sha_invalid";
    errorMessage = "Manifesto de firmware sem hash SHA-256 valido.";
    return false;
  }

  if (info.fileSizeBytes == 0u) {
    errorCode = "firmware_size_invalid";
    errorMessage = "Manifesto de firmware sem tamanho valido.";
    return false;
  }

  return true;
}

bool tryFetchLatestFirmwareRelease(FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  HTTPClient http;
  if (!beginHttpWithDeviceAuth(http, "/api/v1/device/firmware/latest")) {
    errorCode = "firmware_http_begin_failed";
    errorMessage = "Nao foi possivel consultar o catalogo oficial de firmware.";
    return false;
  }

  int code = http.GET();
  if (code == HTTP_CODE_NOT_FOUND) {
    errorCode = "firmware_not_found";
    errorMessage = "Nao existe pacote oficial de firmware para este dispositivo.";
    http.end();
    return false;
  }

  if (code < 200 || code >= 300) {
    errorCode = "firmware_http_error";
    errorMessage = String("Falha ao consultar firmware oficial. HTTP ") + code + ".";
    http.end();
    return false;
  }

