eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  JsonDocument response;
  if (deserializeJson(response, http.getString()) != DeserializationError::Ok) {
    errorCode = "firmware_manifest_invalid";
    errorMessage = "Resposta de firmware oficial invalida.";
    http.end();
    return false;
  }
  http.end();

  if (!tryParseFirmwareReleaseInfo(response, info)) {
    errorCode = "firmware_manifest_invalid";
    errorMessage = "Resposta de firmware oficial incompleta.";
    return false;
  }

  return validateFirmwareReleaseInfo(info, requestedVersion, errorCode, errorMessage);
}

bool performFirmwareOta(const FirmwareReleaseInfo& info, const String& commandId, String& errorCode, String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  sendCommandProgress(commandId, 35, "metadata", "Firmware oficial validado.");
  if (gWs.isConnected()) {
    gWs.disconnect();
  }

  gOtaInProgress = true;
  drawOtaProgressScreen(20, "recebido");

  HTTPClient http;
  if (!beginHttpWithDeviceAuth(http, info.downloadPath)) {
    errorCode = "firmware_download_begin_failed";
    errorMessage = "Nao foi possivel iniciar o download OTA.";
    return false;
  }

  int code = http.GET();
  if (code < 200 || code >= 300) {
    errorCode = "firmware_download_http_error";
    errorMessage = String("Falha ao baixar firmware oficial. HTTP ") + code + ".";
    http.end();
    return false;
  }

  const int contentLength = http.getSize();
  if (contentLength <= 0 || static_cast<uint32_t>(contentLength) != info.fileSizeBytes) {
    errorCode = "firmware_download_size_mismatch";
    errorMessage = "Download OTA retornou tamanho diferente do manifesto oficial.";
    http.end();
    return false;
  }

  if (!Update.begin(info.fileSizeBytes)) {
    errorCode = "ota_begin_failed";
    errorMessage = String("Nao foi possivel reservar espaco OTA. code=") + Update.getError();
    http.end();
    return false;
  }

  WiFiClient* stream = http.getStreamPtr();
  if (stream == nullptr) {
    Update.abort();
    errorCode = "firmware_stream_unavailable";
    errorMessage = "Fluxo HTTP indisponivel para OTA.";
    http.end();
    return false;
  }

  mbedtls_sha256_context shaContext;
  mbedtls_sha256_init(&shaContext);
  if (mbedtls_sha256_starts(&shaContext, 0) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_sha_init_failed";
    errorMessage = "Falha ao inicializar validacao SHA-256 da OTA.";
    http.end();
    return false;
  }

  uint8_t buffer[4096];
  uint32_t totalRead = 0u;
  unsigned long lastDataMs = millis();
  uint8_t lastProgress = 35u;

  while (totalRead < info.fileSizeBytes) {
    const size_t availableBytes = stream->available();
    if (availableBytes == 0u) {
      if (!http.connected()) {
        break;
      }

      if (millis() - lastDataMs > 15000u) {
        Update.abort();
        mbedtls_sha256_free(&shaContext);
        errorCode = "firmware_download_timeout";
        errorMessage = "Download OTA interrompido por timeout.";
        http.end();
        return false;
      }

      delay(1);
      continue;
    }

    const size_t chunkSize = availableBytes < sizeof(buffer) ? availableBytes : sizeof(buffer);
    const int readCount = stream->readBytes(buffer, chunkSize);
    if (readCount <= 0) {
      delay(1);
      continue;
    }

    lastDataMs = millis();
    if (mbedtls_sha256_update(&shaContext, buffer, static_cast<size_t>(readCount)) != 0) {
      Update.abort();
      mbedtls_sha256_free(&shaContext);
      errorCode = "firmware_sha_update_failed";
      errorMessage = "Falha ao atualizar hash SHA-256 durante OTA.";
      http.end();
      return false;
    }

    if (Update.write(buffer, static_cast<size_t>(readCount)) != static_cast<size_t>(readCount)) {
      Update.abort();
      mbedtls_sha256_free(&shaContext);
      errorCode = "ota_write_failed";
      errorMessage = String("Falha ao gravar bloco OTA. code=") + Update.getError();
      http.end();
      return false;
    }

    totalRead += static_cast<uint32_t>(readCount);
    const uint8_t progress = static_cast<uint8_t>(35u + ((static_cast<uint64_t>(totalRead) * 55u) / info.fileSizeBytes));
    if (progress >= static_cast<uint8_t>(lastProgress + 5u) || totalRead >= info.fileSizeBytes) {
      lastProgress = progress;
      sendCommandProgress(commandId, progress > 90u ? 90u : progress, "downloading", "Baixando e gravando firmware...");
      drawOtaProgressScreen(progress > 90u ? 90u : progress, "baixando...");
    }
  }

  http.end();

  if (totalRead != info.fileSizeBytes) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_download_incomplete";
    errorMessage = "Download OTA terminou antes de receber todos os bytes esperados.";
    return false;
  }

  uint8_t shaBytes[32];
  if (mbedtls_sha256_finish(&shaContext, shaBytes) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_sha_finish_failed";
    errorMessage = "Falha ao finalizar hash SHA-256 da OTA.";
    return false;
  }

  mbedtls_sha256_free(&shaContext);
  const String computedSha256 = bytesToLowerHex(shaBytes, sizeof(shaBytes));
  if (!computedSha256.equalsIgnoreCase(info.sha256)) {
    Update.abort();
    errorCode = "firmware_sha_mismatch";
    errorMessage = "Hash SHA-256 divergente no firmware baixado.";
    return false;
  }

  sendCommandProgress(commandId, 92, "flashing", "Validando e finalizando imagem OTA...");
  drawOtaProgressScreen(92, "gravando...");
  if (!Update.end()) {
    errorCode = "ota_end_failed";
    errorMessage = String("Falha ao finalizar OTA. code=") + Update.getError();
    return false;
  }

  if (!Update.isFinished()) {
    errorCode = "ota_incomplete";
    errorMessage = "OTA finalizada sem imagem completa.";
    return false;
  }

  return true;
}

// --- OTA Background Task (Core 0) ---
// Runs the firmware download + SHA-256 verification + flash write entirely on Core 0.
// Does NOT call MQTT (sendCommandProgress) or matrix (drawOtaProgressScreen) functions.
// Communicates via volatile globals: gOtaProgressPercent, gOtaProgressStage, gOtaTaskResult.

void otaDownloadTaskFn(void* parameter) {
  OtaTaskParams* params = static_cast<OtaTaskParams*>(parameter);
  gOtaTaskResult = OtaTaskResult::Running;
  gOtaProgressPercent = 35;
  gOtaProgressStage = "baixando...";

  HTTPClient http;
  if (!beginHttpWithDeviceAuth(http, params->downloadPath)) {
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

