eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  int code = http.GET();
  if (code < 200 || code >= 300) {
    http.end();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  const int contentLength = http.getSize();
  if (contentLength <= 0 || static_cast<uint32_t>(contentLength) != params->fileSizeBytes) {
    http.end();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  if (!Update.begin(params->fileSizeBytes)) {
    http.end();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  WiFiClient* stream = http.getStreamPtr();
  if (stream == nullptr) {
    Update.abort();
    http.end();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  mbedtls_sha256_context shaContext;
  mbedtls_sha256_init(&shaContext);
  if (mbedtls_sha256_starts(&shaContext, 0) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    http.end();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  uint8_t buffer[4096];
  uint32_t totalRead = 0u;
  unsigned long lastDataMs = millis();
  uint8_t lastProgress = 35u;
  bool downloadOk = true;

  while (totalRead < params->fileSizeBytes) {
    const size_t availableBytes = stream->available();
    if (availableBytes == 0u) {
      if (!http.connected()) {
        downloadOk = false;
        break;
      }

      if (millis() - lastDataMs > 15000u) {
        downloadOk = false;
        break;
      }

      vTaskDelay(pdMS_TO_TICKS(1));
      continue;
    }

    const size_t chunkSize = availableBytes < sizeof(buffer) ? availableBytes : sizeof(buffer);
    const int readCount = stream->readBytes(buffer, chunkSize);
    if (readCount <= 0) {
      vTaskDelay(pdMS_TO_TICKS(1));
      continue;
    }

    lastDataMs = millis();
    if (mbedtls_sha256_update(&shaContext, buffer, static_cast<size_t>(readCount)) != 0) {
      downloadOk = false;
      break;
    }

    if (Update.write(buffer, static_cast<size_t>(readCount)) != static_cast<size_t>(readCount)) {
      downloadOk = false;
      break;
    }

    totalRead += static_cast<uint32_t>(readCount);
    const uint8_t progress = static_cast<uint8_t>(35u + ((static_cast<uint64_t>(totalRead) * 55u) / params->fileSizeBytes));
    if (progress >= static_cast<uint8_t>(lastProgress + 5u) || totalRead >= params->fileSizeBytes) {
      lastProgress = progress;
      gOtaProgressPercent = progress > 90u ? 90u : progress;
    }
  }

  http.end();

  if (!downloadOk || totalRead != params->fileSizeBytes) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro download";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  uint8_t shaBytes[32];
  if (mbedtls_sha256_finish(&shaContext, shaBytes) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro sha256";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  mbedtls_sha256_free(&shaContext);
  const String computedSha256 = bytesToLowerHex(shaBytes, sizeof(shaBytes));
  if (!computedSha256.equalsIgnoreCase(params->sha256)) {
    Update.abort();
    gOtaProgressPercent = 0;
    gOtaProgressStage = "sha256 invalido";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  gOtaProgressPercent = 92;
  gOtaProgressStage = "gravando...";

  if (!Update.end() || !Update.isFinished()) {
    gOtaProgressPercent = 0;
    gOtaProgressStage = "erro flash";
    gOtaTaskResult = OtaTaskResult::Failed;
    delete params;
    vTaskDelete(nullptr);
    return;
  }

  gOtaTaskResult = OtaTaskResult::Success;
  delete params;
  vTaskDelete(nullptr);
}

// --- OTA Progress Bridge (Core 1, main loop) ---

void processOtaProgressBridge() {
  const OtaTaskResult result = static_cast<OtaTaskResult>(gOtaTaskResult);
  if (result == OtaTaskResult::Idle) {
    return;
  }

  if (result == OtaTaskResult::Running) {
    const uint8_t currentPercent = gOtaProgressPercent;
    if (currentPercent >= static_cast<uint8_t>(gOtaBridgeLastPercent + 5u)) {
      sendCommandProgress(gOtaBridgeCommandId,
          currentPercent > 90u ? 90u : currentPercent,
          "downloading", "Baixando e gravando firmware...");
      gOtaBridgeLastPercent = currentPercent;
    }
    return;
  }

  if (result == OtaTaskResult::Success) {
    gOtaDownloadTaskHandle = nullptr;

    if (!persistPendingOtaContext(gOtaBridgeCommandId, kFirmwareVersion, gOtaBridgeTargetVersion)) {
      gOtaInProgress = false;
      gOtaTaskResult = OtaTaskResult::Idle;
      gOtaBridgeLastPercent = 0;
      sendCommandProgress(gOtaBridgeCommandId, 100, "failed",
          "Firmware baixado, mas falha ao registrar contexto.", 0);
      return;
    }

    sendCommandProgress(gOtaBridgeCommandId, 94, "rebooting",
        "Firmware aplicado. Reiniciando para validacao segura.");
    gOtaProgressPercent = 94;
    gOtaProgressStage = "reiniciando...";
    (void)publishPresence("offline");
    delay(250);
    ESP.restart();
    return;
  }

  if (result == OtaTaskResult::Failed) {
    gOtaDownloadTaskHandle = nullptr;
    gOtaInProgress = false;

    const char* failStage = gOtaProgressStage;
    String failMessage = String("Falha OTA: ") + (failStage != nullptr ? failStage : "erro desconhecido");
    (void)publishDeviceLog("warning", "command", "ota_task_failed", failMessage);
    sendCommandProgress(gOtaBridgeCommandId, 100, "failed", failMessage, 0);

