eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    gOtaTaskResult = OtaTaskResult::Idle;
    gOtaBridgeLastPercent = 0;
    return;
  }
}

void initializePanelsBatchRuntime() {
  if (gPanelsBatchMutex == nullptr) {
    gPanelsBatchMutex = xSemaphoreCreateMutex();
  }

  if (gPanelsBatchTaskHandle == nullptr) {
    BaseType_t result = xTaskCreatePinnedToCore(
        panelsBatchPlaybackTask,
        "panels_batch_webp",
        kPanelsBatchTaskStackSize,
        nullptr,
        kPanelsBatchTaskPriority,
        &gPanelsBatchTaskHandle,
        1);

    if (result != pdPASS) {
      gAnimatedWebpBatchSupported = false;
      gPanelsBatchTaskHandle = nullptr;
      (void)publishDeviceLog(
          "error",
          "command",
          "panels_batch_runtime_init_failed",
          "Falha ao criar task de playback WebP para Paineis.",
          false);
    }
  }
}

bool tryDownloadPanelsBatch(
    const String& downloadUrl,
    const String& expectedSha256,
    size_t expectedSize,
    const String& expectedContentType,
    PanelsBatchBuffer& batch,
    String& errorCode,
    String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  HTTPClient http;
  if (!beginHttpWithDeviceAuthUrl(http, downloadUrl)) {
    errorCode = "panels_batch_begin_failed";
    errorMessage = "Nao foi possivel iniciar o download do lote WebP.";
    return false;
  }

  const int code = http.GET();
  if (code < 200 || code >= 300) {
    errorCode = "panels_batch_http_error";
    errorMessage = String("Falha ao baixar lote WebP. HTTP ") + code + ".";
    http.end();
    return false;
  }

  const int contentLength = http.getSize();
  if (contentLength <= 0 || static_cast<size_t>(contentLength) != expectedSize) {
    errorCode = "panels_batch_size_mismatch";
    errorMessage = "Download do lote WebP retornou tamanho divergente.";
    http.end();
    return false;
  }

  const String responseContentType = http.header("Content-Type");
  if (expectedContentType.length() > 0
      && responseContentType.length() > 0
      && !responseContentType.startsWith(expectedContentType)) {
    errorCode = "panels_batch_content_type_invalid";
    errorMessage = "Servidor retornou content-type incompativel para lote WebP.";
    http.end();
    return false;
  }

  uint8_t* data = static_cast<uint8_t*>(heap_caps_malloc(expectedSize, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  if (data == nullptr) {
    data = static_cast<uint8_t*>(heap_caps_malloc(expectedSize, MALLOC_CAP_8BIT));
  }

  if (data == nullptr) {
    errorCode = "panels_batch_alloc_failed";
    errorMessage = "Sem memoria para armazenar o lote WebP.";
    http.end();
    return false;
  }

  WiFiClient* stream = http.getStreamPtr();
  if (stream == nullptr) {
    free(data);
    errorCode = "panels_batch_stream_unavailable";
    errorMessage = "Fluxo HTTP indisponivel para lote WebP.";
    http.end();
    return false;
  }

  mbedtls_sha256_context shaContext;
  mbedtls_sha256_init(&shaContext);
  if (mbedtls_sha256_starts(&shaContext, 0) != 0) {
    free(data);
    mbedtls_sha256_free(&shaContext);
    errorCode = "panels_batch_sha_init_failed";
    errorMessage = "Falha ao inicializar SHA-256 do lote WebP.";
    http.end();
    return false;
  }

  size_t totalRead = 0;
  unsigned long lastDataMs = millis();
  while (totalRead < expectedSize) {
    const size_t availableBytes = stream->available();
    if (availableBytes == 0u) {
      if (!http.connected()) {
        break;
      }

      if (millis() - lastDataMs > 15000u) {
        free(data);
        mbedtls_sha256_free(&shaContext);
        errorCode = "panels_batch_download_timeout";
        errorMessage = "Download do lote WebP interrompido por timeout.";
        http.end();
        return false;
      }

      delay(1);
      continue;
    }

    const size_t chunkSize = min(availableBytes, expectedSize - totalRead);
    const int readCount = stream->readBytes(reinterpret_cast<char*>(data + totalRead), chunkSize);
    if (readCount <= 0) {
      delay(1);
      continue;
    }

    lastDataMs = millis();
    if (mbedtls_sha256_update(&shaContext, data + totalRead, static_cast<size_t>(readCount)) != 0) {
      free(data);
      mbedtls_sha256_free(&shaContext);
      errorCode = "panels_batch_sha_update_failed";
      errorMessage = "Falha ao atualizar SHA-256 do lote WebP.";
      http.end();
      return false;
    }

    totalRead += static_cast<size_t>(readCount);
  }

  http.end();

  if (totalRead != expectedSize) {
    free(data);
    mbedtls_sha256_free(&shaContext);
    errorCode = "panels_batch_download_incomplete";
    errorMessage = "Download do lote WebP terminou antes de receber todos os bytes.";
    return false;
  }

  uint8_t shaBytes[32];
  if (mbedtls_sha256_finish(&shaContext, shaBytes) != 0) {
    free(data);
    mbedtls_sha256_free(&shaContext);
    errorCode = "panels_batch_sha_finish_failed";
    errorMessage = "Falha ao finalizar SHA-256 do lote WebP.";
    return false;
  }

  mbedtls_sha256_free(&shaContext);
  const String computedSha256 = bytesToLowerHex(shaBytes, sizeof(shaBytes));
  if (!computedSha256.equalsIgnoreCase(expectedSha256)) {
    free(data);
    errorCode = "panels_batch_sha_mismatch";
    errorMessage = "Hash SHA-256 divergente no lote WebP baixado.";
    return false;
  }

  clearPanelsBatchBuffer(batch);
  batch.data = data;
  batch.length = totalRead;
  return true;
}

bool validatePanelsBatchWebp(
    const PanelsBatchBuffer& batch,
    String& errorCode,
    String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  if (batch.data == nullptr || batch.length == 0u) {
    errorCode = "panels_batch_empty";
    errorMessage = "Lote WebP vazio.";
    return false;
  }

  WebPData webpData;
  WebPDataInit(&webpData);
  webpData.bytes = batch.data;
  webpData.size = batch.length;

  WebPAnimDecoderOptions options;
  if (!WebPAnimDecoderOptionsInit(&options)) {
    errorCode = "panels_batch_decoder_options_failed";
    errorMessage = "Falha ao inicializar opcoes do decoder WebP.";
    return false;
  }

  options.color_mode = MODE_RGBA;
  WebPAnimDecoder* decoder = WebPAnimDecoderNew(&webpData, &options);
  if (decoder == nullptr) {
    errorCode = "panels_batch_decoder_create_failed";
    errorMessage = "Nao foi possivel criar decoder WebP.";
    return false;
  }

  WebPAnimInfo info;
  if (!WebPAnimDecoderGetInfo(decoder, &info)) {
    WebPAnimDecoderDelete(decoder);
    errorCode = "panels_batch_decoder_info_failed";
    errorMessage = "Nao foi possivel ler metadados do WebP animado.";
    return false;
  }

