eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  if (info.canvas_width != static_cast<int>(kMatrixWidth) || info.canvas_height != static_cast<int>(kMatrixHeight)) {
    WebPAnimDecoderDelete(decoder);
    errorCode = "panels_batch_dimensions_invalid";
    errorMessage = "Canvas do WebP animado nao corresponde a 128x64.";
    return false;
  }

  uint32_t observedFrameCount = 0;
  int observedDurationMs = 0;
  while (WebPAnimDecoderHasMoreFrames(decoder)) {
    uint8_t* framePixels = nullptr;
    int timestampMs = 0;
    if (!WebPAnimDecoderGetNext(decoder, &framePixels, &timestampMs) || framePixels == nullptr) {
      WebPAnimDecoderDelete(decoder);
      errorCode = "panels_batch_decoder_frame_failed";
      errorMessage = "Falha ao decodificar frame do WebP animado.";
      return false;
    }

    observedFrameCount++;
    observedDurationMs = timestampMs;
  }

  WebPAnimDecoderDelete(decoder);

  if (batch.frameCount > 0u && observedFrameCount != batch.frameCount) {
    errorCode = "panels_batch_frame_count_mismatch";
    errorMessage = "Quantidade de frames do WebP difere do manifesto do lote.";
    return false;
  }

  if (batch.durationMs > 0u && abs(observedDurationMs - static_cast<int>(batch.durationMs)) > 20) {
    errorCode = "panels_batch_duration_mismatch";
    errorMessage = "Duracao do WebP difere do manifesto do lote.";
    return false;
  }

  return true;
}

bool tryQueuePanelsBatchForPlayback(PanelsBatchBuffer& batch, String& errorCode, String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  if (gPanelsBatchMutex == nullptr) {
    errorCode = "panels_batch_runtime_unavailable";
    errorMessage = "Runtime de playback WebP nao inicializado.";
    return false;
  }

  if (xSemaphoreTake(gPanelsBatchMutex, portMAX_DELAY) != pdTRUE) {
    errorCode = "panels_batch_mutex_failed";
    errorMessage = "Falha ao sincronizar fila de playback WebP.";
    return false;
  }

  const bool sessionChanged = gPanelsBatchCurrentSessionId.length() > 0
      && !gPanelsBatchCurrentSessionId.equals(batch.panelsSessionId);

  if (sessionChanged) {
    gPanelsBatchCancelRequested = true;
    clearPanelsBatchBuffer(gPanelsBatchPending);
    gPanelsBatchCurrentSessionId = "";
    gPanelsBatchCurrentSequence = 0u;
  }

  if (batch.panelsSessionId.equals(gPanelsBatchCurrentSessionId)
      && batch.batchSequence <= gPanelsBatchCurrentSequence) {
    xSemaphoreGive(gPanelsBatchMutex);
    clearPanelsBatchBuffer(batch);
    return true;
  }

  if (gPanelsBatchPending.data != nullptr) {
    if (batch.panelsSessionId.equals(gPanelsBatchPending.panelsSessionId)
        && batch.batchSequence <= gPanelsBatchPending.batchSequence) {
      xSemaphoreGive(gPanelsBatchMutex);
      clearPanelsBatchBuffer(batch);
      return true;
    }

    clearPanelsBatchBuffer(gPanelsBatchPending);
  }

  movePanelsBatchBuffer(batch, gPanelsBatchPending);
  gPanelsBatchUnderrun = false;
  xSemaphoreGive(gPanelsBatchMutex);

  if (gPanelsBatchTaskHandle != nullptr) {
    xTaskNotifyGive(gPanelsBatchTaskHandle);
  }

  return true;
}

bool tryPresentWebpRgbaFrame(const uint8_t* rgbaPixels, size_t rgbaLength) {
  if (rgbaPixels == nullptr || rgbaLength < (kMatrixPixelCount * 4u)) {
    return false;
  }

  const uint8_t nextFrameIndex = static_cast<uint8_t>(gFrameRgb565ActiveIndex ^ 1u);
  uint16_t* frameBackBuffer = gFrameRgb565Buffers[nextFrameIndex];
  for (size_t pixelIndex = 0; pixelIndex < kMatrixPixelCount; pixelIndex++) {
    const size_t offset = pixelIndex * 4u;
    frameBackBuffer[pixelIndex] = rgb888ToRgb565(
        rgbaPixels[offset],
        rgbaPixels[offset + 1u],
        rgbaPixels[offset + 2u]);
  }

  portENTER_CRITICAL(&gStreamBufferMux);
  gFrameRgb565ActiveIndex = nextFrameIndex;
  portEXIT_CRITICAL(&gStreamBufferMux);

  gFrameModeActive = true;
  gLastFrameMs = millis();
  gMatrixSignalTimedOut = false;
  markMatrixFrameDirty(false);
  return true;
}

bool waitForPanelsBatchTimestampUs(int64_t batchStartedUs, int timestampMs) {
  const int64_t targetUs = batchStartedUs + (static_cast<int64_t>(timestampMs) * 1000LL);
  while (true) {
    if (gPanelsBatchMutex != nullptr && xSemaphoreTake(gPanelsBatchMutex, portMAX_DELAY) == pdTRUE) {
      const bool cancelled = gPanelsBatchCancelRequested;
      xSemaphoreGive(gPanelsBatchMutex);
      if (cancelled) {
        return false;
      }
    }

    const int64_t nowUs = esp_timer_get_time();
    if (nowUs >= targetUs) {
      return true;
    }

    const int64_t remainingUs = targetUs - nowUs;
    if (remainingUs > static_cast<int64_t>(kPanelsBatchWaitChunkMs) * 1000LL) {
      vTaskDelay(pdMS_TO_TICKS(kPanelsBatchWaitChunkMs));
    } else {
      taskYIELD();
    }
  }
}

void panelsBatchPlaybackTask(void* parameter) {
  (void)parameter;
  PanelsBatchBuffer current = {};

  while (true) {
    if (gPanelsBatchMutex != nullptr && xSemaphoreTake(gPanelsBatchMutex, portMAX_DELAY) == pdTRUE) {
      if (gPanelsBatchCancelRequested) {
        gPanelsBatchCancelRequested = false;
        clearPanelsBatchBuffer(current);
        gPanelsBatchCurrentSessionId = "";
        gPanelsBatchCurrentSequence = 0u;
      }

      if (current.data == nullptr && gPanelsBatchPending.data != nullptr) {
        movePanelsBatchBuffer(gPanelsBatchPending, current);
        gPanelsBatchCurrentSessionId = current.panelsSessionId;
        gPanelsBatchCurrentSequence = current.batchSequence;
      }

      xSemaphoreGive(gPanelsBatchMutex);
    }

    if (current.data == nullptr) {
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(20));
      continue;
    }

    WebPData webpData;
    WebPDataInit(&webpData);
    webpData.bytes = current.data;
    webpData.size = current.length;

    WebPAnimDecoderOptions options;
    WebPAnimDecoderOptionsInit(&options);
    options.color_mode = MODE_RGBA;

    WebPAnimDecoder* decoder = WebPAnimDecoderNew(&webpData, &options);
    if (decoder == nullptr) {
      (void)publishDeviceLog("error", "command", "panels_batch_decoder_create_failed", "Falha ao criar decoder do lote WebP.", false);
      clearPanelsBatchBuffer(current);
      continue;
    }

    WebPAnimInfo info;
    if (!WebPAnimDecoderGetInfo(decoder, &info)) {
      (void)publishDeviceLog("error", "command", "panels_batch_decoder_info_failed", "Falha ao ler metadados do lote WebP.", false);
      WebPAnimDecoderDelete(decoder);
      clearPanelsBatchBuffer(current);
      continue;
    }

    const int64_t batchStartedUs = esp_timer_get_time();
    bool cancelled = false;
    bool decodeFailed = false;

    while (WebPAnimDecoderHasMoreFrames(decoder)) {
      uint8_t* rgbaPixels = nullptr;
      int timestampMs = 0;
      if (!WebPAnimDecoderGetNext(decoder, &rgbaPixels, &timestampMs) || rgbaPixels == nullptr) {
        decodeFailed = true;
        break;
      }

      if (!tryPresentWebpRgbaFrame(rgbaPixels, static_cast<size_t>(info.canvas_width) * static_cast<size_t>(info.canvas_height) * 4u)) {
        decodeFailed = true;
        break;
      }

      if (!waitForPanelsBatchTimestampUs(batchStartedUs, timestampMs)) {
        cancelled = true;
        break;
      }
    }

    WebPAnimDecoderDelete(decoder);

    if (gPanelsBatchMutex != nullptr && xSemaphoreTake(gPanelsBatchMutex, portMAX_DELAY) == pdTRUE) {
      if (gPanelsBatchCurrentSequence == current.batchSequence
          && gPanelsBatchCurrentSessionId.equals(current.panelsSessionId)) {
        gPanelsBatchCurrentSequence = 0u;
        gPanelsBatchCurrentSessionId = "";
      }

      if (!cancelled && gPanelsBatchPending.data == nullptr) {
        gPanelsBatchUnderrun = true;
      }

      xSemaphoreGive(gPanelsBatchMutex);
    }

    if (decodeFailed) {
      (void)publishDeviceLog("warning", "command", "panels_batch_decode_failed", "Falha ao reproduzir um lote WebP de Paineis.", false);
    }

