eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
void processPendingOtaSafeUpdate() {
  if (gPendingOtaBootState == PendingOtaBootState::PendingVerify) {
    if (gPendingOtaValidationStartedMs == 0u) {
      gPendingOtaValidationStartedMs = millis();
      gOtaInProgress = true;
      drawOtaProgressScreen(97, "validando...");
    }

    if (millis() - gPendingOtaValidationStartedMs >= kOtaSelfTestWindowMs) {
      if (!String(kFirmwareVersion).equalsIgnoreCase(gPendingOtaTargetVersion)) {
        drawOtaProgressScreen(0, "rollback!");
        delay(2000);
        gOtaInProgress = false;
        requestPendingOtaRollbackAndReboot(
            "ota_target_version_mismatch",
            "Safe update mode detectou firmware diferente da versao alvo apos o reboot.");
        return;
      }

      const esp_err_t validationError = esp_ota_mark_app_valid_cancel_rollback();
      if (validationError != ESP_OK) {
        drawOtaProgressScreen(0, "rollback!");
        delay(2000);
        gOtaInProgress = false;
        requestPendingOtaRollbackAndReboot(
            "ota_mark_valid_failed",
            String("Falha ao confirmar a imagem OTA: ") + esp_err_to_name(validationError) + ".");
        return;
      }

      drawOtaProgressScreen(100, "concluido!");
      delay(2000);
      gOtaInProgress = false;

      gPendingOtaBootState = PendingOtaBootState::ValidatedPendingReport;
      gPendingOtaPendingVerifyAnnounced = false;
      gPendingOtaValidationStartedMs = 0u;
      Serial.printf("[ota] imagem OTA validada com sucesso: %s\n", kFirmwareVersion);
    }
  }

  publishPendingOtaReportIfNeeded();
}

bool trySanitizeLargestFreeBlock(uint32_t freeBytes, size_t largestRawBytes, uint32_t& largestSanitizedBytes) {
  if (freeBytes == 0 || largestRawBytes == 0) {
    return false;
  }

  size_t normalizedLargest = largestRawBytes;
  if (normalizedLargest > freeBytes) {
    normalizedLargest = freeBytes;
  }

  if (normalizedLargest == 0) {
    return false;
  }

  largestSanitizedBytes = static_cast<uint32_t>(normalizedLargest);
  return true;
}

uint32_t elapsedMicrosSince(uint32_t startUs) {
  return static_cast<uint32_t>(micros() - startUs);
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#saude-oficial-do-loop
void updateLoopHealthyPercent(uint32_t loopDurationUs) {
  const unsigned long nowMs = millis();
  if (gLoopWindowStartMs == 0) {
    gLoopWindowStartMs = nowMs;
  }

  gLoopWindowIterationCount++;
  if (loopDurationUs <= kHealthyLoopThresholdUs) {
    gLoopWindowHealthyCount++;
  }

  const unsigned long windowElapsedMs = nowMs - gLoopWindowStartMs;
  if (windowElapsedMs < kLoopHealthWindowMs) {
    return;
  }

  uint32_t healthyPercent = 0;
  if (gLoopWindowIterationCount > 0) {
    healthyPercent = static_cast<uint32_t>(
        (static_cast<uint64_t>(gLoopWindowHealthyCount) * 100ULL
            + static_cast<uint64_t>(gLoopWindowIterationCount / 2u))
        / static_cast<uint64_t>(gLoopWindowIterationCount));
  }

  if (healthyPercent > 100u) {
    healthyPercent = 100u;
  }

  gLoopHealthyPercent = static_cast<uint8_t>(healthyPercent);
  gLoopHealthyPercentReady = true;
  gLoopWindowIterationCount = 0;
  gLoopWindowHealthyCount = 0;
  gLoopWindowStartMs = nowMs;
}

void reportPerfMetrics() {
  const unsigned long now = millis();
  if (gPerfLastReportMs != 0 && (now - gPerfLastReportMs) < kTelemetryIntervalMs) {
    return;
  }

  const uint32_t elapsed = gPerfLastReportMs == 0 ? 0 : static_cast<uint32_t>(now - gPerfLastReportMs);
  const uint32_t presentedSinceLastReport = gHub75PresentFrames - gPerfHub75PresentFramesAtLastReport;
  const uint32_t hub75Fps = (elapsed > 0)
      ? static_cast<uint32_t>((static_cast<uint64_t>(presentedSinceLastReport) * 1000ULL) / elapsed)
      : 0;

  gPerfLastReportLoopMaxUs = gPerfLoopMaxUs;
  gPerfLastReportNetworkMaxUs = gPerfNetworkMaxUs;
  gPerfLastReportRenderMaxUs = gPerfRenderMaxUs;
  gPerfLastReportSerialMaxUs = gPerfSerialMaxUs;

  Serial.printf(
      "[perf] loop_max_us=%lu net_max_us=%lu render_max_us=%lu serial_max_us=%lu hub75_fps=%lu render_skips=%lu\n",
      static_cast<unsigned long>(gPerfLoopMaxUs),
      static_cast<unsigned long>(gPerfNetworkMaxUs),
      static_cast<unsigned long>(gPerfRenderMaxUs),
      static_cast<unsigned long>(gPerfSerialMaxUs),
      static_cast<unsigned long>(hub75Fps),
      static_cast<unsigned long>(gPerfRenderSkipCount));

  if (gPanelsBatchTaskHandle != nullptr) {
    const UBaseType_t batchHwm = uxTaskGetStackHighWaterMark(gPanelsBatchTaskHandle);
    const UBaseType_t loopHwm = uxTaskGetStackHighWaterMark(nullptr);
    Serial.printf(
        "[perf] loopTask_stack_hwm=%u batchTask_stack_hwm=%u\n",
        static_cast<unsigned>(loopHwm),
        static_cast<unsigned>(batchHwm));
  }

  gPerfLoopMaxUs = 0;
  gPerfNetworkMaxUs = 0;
  gPerfRenderMaxUs = 0;
  gPerfSerialMaxUs = 0;
  gPerfRenderSkipCount = 0;
  gPerfHub75PresentFramesAtLastReport = gHub75PresentFrames;
  gPerfLastReportMs = now;
}

void sendTelemetry(bool force) {
  if (!gMqtt.connected() || gDeviceId.isEmpty()) {
    return;
  }

  unsigned long now = millis();
  if (!force && now - gLastTelemetryMs < kTelemetryIntervalMs) {
    return;
  }

  gLastTelemetryMs = now;

  JsonDocument telemetry;
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  const uint32_t uptimeSeconds = millis() / 1000UL;
  const uint32_t freeHeapBytes = ESP.getFreeHeap();

  telemetry["deviceId"] = gDeviceId;
  telemetry["wifiConnected"] = wifiConnected;
  telemetry["wifiState"] = gWifiState;
  telemetry["provisioningPortalActive"] = gProvisioningPortalActive;
  telemetry["auxLedAvailable"] = gAuxLedAvailable;
  telemetry["testLedAvailable"] = isTestLedAvailable();
  telemetry["lastWifiEvent"] = gLastWifiEvent;
  telemetry["rssi"] = wifiConnected ? WiFi.RSSI() : -100;
  telemetry["uptimeSeconds"] = uptimeSeconds;
  if (gLoopHealthyPercentReady) {
    telemetry["loopHealthyPercent"] = gLoopHealthyPercent;
  }
  telemetry["freeHeapBytes"] = freeHeapBytes;
  telemetry["streamFramesReceived"] = gStreamFramesReceived;
  telemetry["streamFramesApplied"] = gStreamFramesApplied;
  telemetry["hub75PresentFrames"] = gHub75PresentFrames;
  telemetry["streamSequenceGapCount"] = gStreamSequenceGapCount;
  telemetry["streamInvalidFrameCount"] = gStreamInvalidFrameCount;
  telemetry["networkPollDeferCount"] = gNetworkPollDeferCount;
  telemetry["telemetrySequence"] = ++gTelemetrySequence;
  telemetry["brightnessCap"] = gBrightnessCap;
  telemetry["brightnessRequested"] = gStreamBrightness;
  telemetry["brightnessApplied"] = gAppliedBrightness;
  telemetry["testLedEnabled"] = gTestLedEnabled;
  telemetry["testLedDuty"] = gTestLedDuty;
  if (gHasStreamLastSequence) {
    telemetry["streamLastSequence"] = gStreamLastSequence;
  }

  uint32_t largestHeapBlockBytes = 0;
  if (trySanitizeLargestFreeBlock(freeHeapBytes, heap_caps_get_largest_free_block(MALLOC_CAP_8BIT), largestHeapBlockBytes)) {
    telemetry["largestHeapBlockBytes"] = largestHeapBlockBytes;
  }

  const bool psramAvailable = ESP.getPsramSize() > 0;
  telemetry["psramAvailable"] = psramAvailable;
  if (psramAvailable) {
    const uint32_t freePsramBytes = ESP.getFreePsram();
    telemetry["freePsramBytes"] = freePsramBytes;

