eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  const uint16_t resolvedPort = port == 0 ? 5272 : port;
  return "http://" + host + ":" + String(resolvedPort);
}

bool tryApplyProvisioningPortalServer(
    const String& rawServerBaseUrl,
    const String& savedHost,
    uint16_t savedPort,
    String& errorCode,
    String& errorMessage) {
  String normalizedServerBaseUrl = rawServerBaseUrl;
  normalizedServerBaseUrl.trim();

  if (normalizedServerBaseUrl.length() == 0) {
    if (savedHost.length() > 0 && savedPort != 0) {
      gServerHost = savedHost;
      gServerPort = savedPort;
      gMqttHost = gServerHost;
      gMqttPort = kDefaultMqttPort;
      gMqttRootTopic = kDefaultMqttRootTopic;
      persistMqttConfig();
      setConnectivityState(kWifiStateConnected, "portal_server_empty_kept_saved", true);
      Serial.printf("[provisioning] campo Servidor vazio; mantendo configuracao salva %s.\n",
          buildServerBaseUrl(gServerHost, gServerPort).c_str());
      return true;
    }

    errorCode = "portal_server_missing";
    errorMessage = "Campo Servidor vazio e sem configuracao salva.";
    setConnectivityState(kWifiStateConnected, "portal_server_missing", true);
    Serial.println("[provisioning] campo Servidor vazio e sem configuracao salva.");
    return false;
  }

  String parsedHost;
  uint16_t parsedPort = 0;
  if (!tryParseServerBaseUrl(normalizedServerBaseUrl, parsedHost, parsedPort)) {
    if (savedHost.length() > 0 && savedPort != 0) {
      gServerHost = savedHost;
      gServerPort = savedPort;
      gMqttHost = gServerHost;
      gMqttPort = kDefaultMqttPort;
      gMqttRootTopic = kDefaultMqttRootTopic;
      persistMqttConfig();
      errorCode = "portal_server_invalid_kept_saved";
      errorMessage = "Campo Servidor invalido; mantendo configuracao salva.";
      setConnectivityState(kWifiStateConnected, "portal_server_invalid_kept_saved", true);
      Serial.printf("[provisioning] campo Servidor invalido '%s'; mantendo configuracao salva %s.\n",
          normalizedServerBaseUrl.c_str(),
          buildServerBaseUrl(gServerHost, gServerPort).c_str());
      return true;
    }

    errorCode = "portal_server_invalid";
    errorMessage = "Campo Servidor invalido no portal.";
    setConnectivityState(kWifiStateConnected, "portal_server_invalid", true);
    Serial.printf("[provisioning] campo Servidor invalido '%s' e sem configuracao salva.\n", normalizedServerBaseUrl.c_str());
    return false;
  }

  gServerHost = parsedHost;
  gServerPort = parsedPort;
  gPrefs.putString("host", gServerHost);
  gPrefs.putString("port", String(gServerPort));
  gMqttHost = gServerHost;
  gMqttPort = kDefaultMqttPort;
  gMqttRootTopic = kDefaultMqttRootTopic;
  persistMqttConfig();
  setConnectivityState(kWifiStateConnected, "portal_server_configured", true);
  Serial.printf("[provisioning] servidor configurado manualmente: %s.\n", buildServerBaseUrl(gServerHost, gServerPort).c_str());
  return true;
}

bool connectWifiWithTimeout(const String& ssid, const String& password, unsigned long timeoutMs) {
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), password.c_str());
  setConnectivityState(kWifiStateConnecting, "wifi_connecting", true);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED) {
    if (millis() - start > timeoutMs) {
      return false;
    }

    delay(200);
  }

  gWifiDisconnectedSinceMs = 0;
  setConnectivityState(kWifiStateConnected, "wifi_connected", true);
  return true;
}

bool pairWithServer(const String& pairingCode, const String& deviceName, String& errorCode, String& errorMessage) {
  if (pairingCode.length() == 0) {
    setConnectivityState(kWifiStateConnected, "provisioned_without_pairing", true);
    return true;
  }

  HTTPClient http;
  String url = "http://" + gServerHost + ":" + String(gServerPort) + "/api/v1/pair";
  if (!http.begin(url)) {
    errorCode = "pair_http_begin_failed";
    errorMessage = "Nao foi possivel iniciar conexao HTTP para pareamento.";
    setConnectivityState(kWifiStateConnected, "pair_http_begin_failed", true);
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  JsonDocument req;
  req["pairingCode"] = pairingCode;
  req["deviceName"] = deviceName;
  req["profile"] = kFirmwareProfile;
  req["firmwareVersion"] = kFirmwareVersion;
  req["boardModel"] = kBoardModel;
  req["panelType"] = kPanelType;

  String body;
  serializeJson(req, body);
  int code = http.POST(body);
  if (code >= 200 && code < 300) {
    JsonDocument resp;
    if (deserializeJson(resp, http.getString()) != DeserializationError::Ok) {
      errorCode = "pair_response_invalid";
      errorMessage = "Resposta de pareamento invalida.";
      http.end();
      return false;
    }

    gDeviceId = resp["deviceId"] | "";
    gToken = resp["token"] | "";
    if (gDeviceId.isEmpty() || gToken.isEmpty()) {
      errorCode = "pair_response_missing_auth";
      errorMessage = "Resposta de pareamento sem credenciais.";
      http.end();
      return false;
    }

    gPrefs.putString("deviceId", gDeviceId);
    gPrefs.putString("token", gToken);

    // Atualiza host/port a partir do httpBase retornado pelo servidor,
    // garantindo que o dispositivo use o IP real em vez de micaaudio.local.
    String httpBase = resp["httpBase"] | "";
    String parsedHost;
    uint16_t parsedPort = 0;
    if (httpBase.length() > 0 && tryParseServerBaseUrl(httpBase, parsedHost, parsedPort)) {
      gServerHost = parsedHost;
      gServerPort = parsedPort;
      gPrefs.putString("host", gServerHost);
      gPrefs.putString("port", String(gServerPort));
    }

    String mqttHost = resp["mqttHost"] | "";
    int mqttPort = resp["mqttPort"] | 0;
    String mqttRootTopic = resp["mqttRootTopic"] | "";
    gMqttHost = mqttHost.length() > 0 ? mqttHost : gServerHost;
    gMqttPort = mqttPort > 0 ? static_cast<uint16_t>(mqttPort) : kDefaultMqttPort;
    gMqttRootTopic = mqttRootTopic.length() > 0 ? mqttRootTopic : kDefaultMqttRootTopic;
    persistMqttConfig();

    setConnectivityState(kWifiStateConnected, "pair_success", true);
    http.end();
    return true;
  }

  errorCode = "pair_http_error";
  errorMessage = "Servidor rejeitou pareamento.";
  setConnectivityState(kWifiStateConnected, "pair_http_error", true);
  http.end();
  return false;
}

