eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    sendCommandProgress(commandId, 100, "set-brightness", "Brilho atualizado.", 1);
    return;
  }

  if (strcmp(command, "update_firmware") == 0) {
    String requestedVersion = parameters["version"] | "";
    FirmwareReleaseInfo releaseInfo;
    String errorCode;
    String errorMessage;

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (isRunningAppPendingVerify()) {
      errorCode = "ota_invalid_state_pending_verify";
      errorMessage = "A imagem atual ainda nao foi validada pelo safe update mode; conclua ou aguarde o primeiro boot antes de nova OTA.";
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (!tryFetchLatestFirmwareRelease(releaseInfo, requestedVersion, errorCode, errorMessage)) {
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (gOtaDownloadTaskHandle != nullptr || gOtaTaskResult != OtaTaskResult::Idle) {
      sendCommandProgress(commandId, 100, "failed", "OTA ja em andamento.", 0);
      return;
    }

    sendCommandProgress(commandId, 35, "metadata", "Firmware oficial validado.");
    if (gWs.isConnected()) {
      gWs.disconnect();
    }

    gOtaInProgress = true;
    gOtaProgressPercent = 20;
    gOtaProgressStage = "recebido";
    gHub75FallbackDirty = true;

    gOtaBridgeCommandId = commandId;
    gOtaBridgeTargetVersion = releaseInfo.firmwareVersion;
    gOtaBridgeLastPercent = 35;
    gOtaTaskResult = OtaTaskResult::Idle;

    OtaTaskParams* params = new OtaTaskParams{
      releaseInfo.downloadPath, releaseInfo.sha256, releaseInfo.fileSizeBytes,
      commandId, String(kFirmwareVersion), releaseInfo.firmwareVersion
    };

    BaseType_t rc = xTaskCreatePinnedToCore(
        otaDownloadTaskFn, "ota_download",
        kOtaDownloadTaskStackSize, params,
        kOtaDownloadTaskPriority, &gOtaDownloadTaskHandle, 0);

    if (rc != pdPASS) {
      delete params;
      gOtaInProgress = false;
      gOtaDownloadTaskHandle = nullptr;
      sendCommandProgress(commandId, 100, "failed", "Falha ao criar task OTA.", 0);
    }
    return;
  }

  if (strcmp(command, "install_app") == 0) {
    String appId = parameters["appId"] | "";
    String appName = parameters["displayName"] | "";
    String configJson = parameters["configJson"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "install_app_missing_appid", "appId ausente para install_app.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    sendCommandProgress(commandId, 70, "install-app", "Salvando app...");
    gActiveAppId = appId;
    gActiveAppName = appName.length() > 0 ? appName : appId;
    gActiveAppConfig = configJson;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppName", gActiveAppName);
    gPrefs.putString("activeAppConfig", gActiveAppConfig);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "install-app", "App instalado.", 1);
    return;
  }

  if (strcmp(command, "activate_app") == 0) {
    String appId = parameters["appId"] | "";
    String appName = parameters["displayName"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "activate_app_missing_appid", "appId ausente para activate_app.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    gActiveAppId = appId;
    gActiveAppName = appName.length() > 0 ? appName : appId;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppName", gActiveAppName);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "activate-app", "App ativado.", 1);
    return;
  }

  if (strcmp(command, "set_app_config") == 0) {
    String appId = parameters["appId"] | "";
    String configJson = parameters["configJson"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (appId.length() == 0) {
      (void)publishDeviceLog("warning", "command", "set_app_config_missing_appid", "appId ausente para set_app_config.");
      sendCommandProgress(commandId, 100, "invalid", "appId ausente.", 0);
      return;
    }

    gActiveAppId = appId;
    gActiveAppConfig = configJson;
    gPrefs.putString("activeAppId", gActiveAppId);
    gPrefs.putString("activeAppConfig", gActiveAppConfig);
    sendTelemetry(true);

    sendCommandProgress(commandId, 100, "set-app-config", "Configuracao aplicada.", 1);
    return;
  }

  if (strcmp(command, "queue_panels_batch") == 0) {
    String panelsSessionId = parameters["panelsSessionId"] | "";
    String downloadUrl = parameters["downloadUrl"] | "";
    String expectedSha256 = normalizeLowerHex(parameters["sha256"] | "");
    String expectedContentType = parameters["contentType"] | "";
    uint32_t batchSequence = 0u;
    uint32_t fileSizeBytes = 0u;
    uint32_t frameCount = 0u;
    uint32_t durationMs = 0u;

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");

    if (!gAnimatedWebpBatchSupported) {
      sendCommandProgress(commandId, 100, "unsupported", "Firmware sem suporte ao transporte WebP batch.", 0);
      return;
    }

    if (panelsSessionId.length() == 0
        || downloadUrl.length() == 0
        || expectedSha256.length() != 64
        || !tryParseUnsignedLongParameter(parameters["batchSequence"], batchSequence)
        || !tryParseUnsignedLongParameter(parameters["fileSizeBytes"], fileSizeBytes)
        || !tryParseUnsignedLongParameter(parameters["frameCount"], frameCount)
        || !tryParseUnsignedLongParameter(parameters["durationMs"], durationMs)) {
      (void)publishDeviceLog("warning", "command", "queue_panels_batch_invalid", "Parametros invalidos para queue_panels_batch.");
      sendCommandProgress(commandId, 100, "invalid", "Parametros invalidos para queue_panels_batch.", 0);
      return;
    }

    if (!expectedContentType.equalsIgnoreCase(kPanelsBatchExpectedContentType)) {
      (void)publishDeviceLog("warning", "command", "queue_panels_batch_content_type_invalid", "contentType invalido para queue_panels_batch.");
      sendCommandProgress(commandId, 100, "invalid", "contentType invalido para queue_panels_batch.", 0);
      return;
    }

    sendCommandProgress(commandId, 35, "downloading", "Baixando lote WebP...");

    PanelsBatchBuffer batch = {};
    batch.panelsSessionId = panelsSessionId;
    batch.batchSequence = batchSequence;
    batch.frameCount = static_cast<uint16_t>(frameCount);
    batch.durationMs = static_cast<uint16_t>(durationMs);

    String errorCode;
    String errorMessage;
    if (!tryDownloadPanelsBatch(downloadUrl, expectedSha256, fileSizeBytes, expectedContentType, batch, errorCode, errorMessage)) {
      clearPanelsBatchBuffer(batch);
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

