eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    sendCommandProgress(commandId, 70, "validating", "Validando lote WebP...");
    if (!validatePanelsBatchWebp(batch, errorCode, errorMessage)) {
      clearPanelsBatchBuffer(batch);
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    if (!tryQueuePanelsBatchForPlayback(batch, errorCode, errorMessage)) {
      clearPanelsBatchBuffer(batch);
      (void)publishDeviceLog("warning", "command", errorCode.c_str(), errorMessage);
      sendCommandProgress(commandId, 100, "failed", errorMessage, 0);
      return;
    }

    sendCommandProgress(commandId, 100, "queued", "Lote WebP de Paineis enfileirado.", 1);
    return;
  }

  (void)publishDeviceLog("warning", "command", "unknown_command", String("Comando desconhecido: ") + command);
  sendCommandProgress(commandId, 100, "unknown", "Comando desconhecido.", 0);
}

void onMqttMessage(char* topic, uint8_t* payload, unsigned int length) {
  if (topic == nullptr || payload == nullptr || length == 0 || gDeviceId.isEmpty()) {
    return;
  }

  String expectedTopic = buildDeviceMqttTopic("commands");
  if (!expectedTopic.equals(topic)) {
    return;
  }

  JsonDocument control;
  if (deserializeJson(control, payload, length) != DeserializationError::Ok) {
    return;
  }

  handleControlCommandMessage(control);
}

// DOCS: docs/wiki/guides/operate-device-lifecycle.md#passos
void onWsEvent(WStype_t type, uint8_t *payload, size_t len) {
  if (type == WStype_CONNECTED) {
    gWsDisconnectedSinceMs = 0;
    registerWsConnectivitySample(true);
    setConnectivityState(kWifiStateConnected, "ws_connected", true, false);
    Serial.println("[ws_connected] sessao websocket estabelecida.");
    sendTelemetry(true);
    return;
  }

  if (type == WStype_DISCONNECTED) {
    registerWsConnectivitySample(false);
    setConnectivityState(WiFi.status() == WL_CONNECTED ? kWifiStateConnected : kWifiStateDisconnected, "ws_disconnected", true, false);
    Serial.println("[ws_disconnected] sessao websocket encerrada.");
    gLastTelemetryMs = 0;
    return;
  }

  if (type == WStype_BIN) {
    if (payload == nullptr || len < 2) {
      registerInvalidStreamFrame("payload_short");
      return;
    }

    if (payload[0] != kStreamVersion) {
      registerInvalidStreamFrame("version_invalid");
      return;
    }

    uint32_t frameSequence = 0;
    const bool hasSequence = len >= 6;
    if (hasSequence) {
      frameSequence = static_cast<uint32_t>(payload[2]) |
                      (static_cast<uint32_t>(payload[3]) << 8) |
                      (static_cast<uint32_t>(payload[4]) << 16) |
                      (static_cast<uint32_t>(payload[5]) << 24);
    }

    const uint8_t messageType = payload[1];
    if (messageType == kStreamBinsMessageType) {
      if (len < kStreamFrameSize) {
        registerInvalidStreamFrame("bins_short");
        return;
      }

      cancelPanelsBatchPlayback();

      gStreamFramesReceived++;
      if (hasSequence) {
        if (gHasStreamLastSequence && frameSequence > gStreamLastSequence + 1u) {
          gStreamSequenceGapCount += frameSequence - (gStreamLastSequence + 1u);
        }

        gStreamLastSequence = frameSequence;
        gHasStreamLastSequence = true;
      }

      const uint8_t nextBinsIndex = static_cast<uint8_t>(gBinsActiveIndex ^ 1u);
      portENTER_CRITICAL(&gStreamBufferMux);
      gLevel = payload[14];
      memcpy(gBinsBuffers[nextBinsIndex], payload + 15, kBinsCount);
      gBinsActiveIndex = nextBinsIndex;
      gStreamBrightness = payload[143];
      gBinsFlags = payload[144];
      portEXIT_CRITICAL(&gStreamBufferMux);
      gFrameModeActive = false;
      gLastFrameMs = millis();
      gMatrixSignalTimedOut = false;
      markMatrixFrameDirty(true);
      return;
    }

    if (messageType == kStreamFrame128x64Rgb565MessageType) {
      if (len < kStreamFrame128x64Rgb565Size) {
        registerInvalidStreamFrame("frame_short");
        return;
      }

      cancelPanelsBatchPlayback();

      gStreamFramesReceived++;
      if (hasSequence) {
        if (gHasStreamLastSequence && frameSequence > gStreamLastSequence + 1u) {
          gStreamSequenceGapCount += frameSequence - (gStreamLastSequence + 1u);
        }

        gStreamLastSequence = frameSequence;
        gHasStreamLastSequence = true;
      }

      const uint8_t nextFrameIndex = static_cast<uint8_t>(gFrameRgb565ActiveIndex ^ 1u);
      uint16_t* frameBackBuffer = gFrameRgb565Buffers[nextFrameIndex];
      gStreamBrightness = payload[14];
      // Payload is already little-endian and ESP32 is little-endian, so we can bulk copy.
      memcpy(frameBackBuffer, payload + 15, static_cast<size_t>(kMatrixPixelCount) * sizeof(uint16_t));

      portENTER_CRITICAL(&gStreamBufferMux);
      gFrameRgb565ActiveIndex = nextFrameIndex;
      portEXIT_CRITICAL(&gStreamBufferMux);

      gFrameModeActive = true;
      gLastFrameMs = millis();
      gMatrixSignalTimedOut = false;
      markMatrixFrameDirty(true);
      return;
    }

    registerInvalidStreamFrame("message_type_unknown");

    return;
  }

  if (type != WStype_TEXT || payload == nullptr || len == 0) {
    return;
  }

  JsonDocument control;
  if (deserializeJson(control, payload, len) != DeserializationError::Ok) {
    return;
  }
  handleControlCommandMessage(control);
}

void connectWebSocket() {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    setConnectivityState(kWifiStateConnecting, "ws_missing_auth", true, false);
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    setConnectivityState(kWifiStateConnecting, "ws_waiting_wifi", true, false);
    return;
  }

  String extraHeaders = "X-Device-Id: " + gDeviceId + "\r\nX-Device-Token: " + gToken;
  gWs.setExtraHeaders(extraHeaders.c_str());
  String path = "/ws/v1/stream";
  Serial.printf("[ws] conectando em ws://%s:%u%s\n", gServerHost.c_str(), gServerPort, path.c_str());
  setConnectivityState(kWifiStateConnected, "ws_connecting", true, false);
  gWs.begin(gServerHost.c_str(), gServerPort, path.c_str());
  gWs.onEvent(onWsEvent);
  gWs.setReconnectInterval(kWsAutoReconnectIntervalMs);
}

void connectMqtt() {
  normalizeMqttConfig();
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gMqttHost.isEmpty()) {
    return;
  }

