eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  if (gMqtt.connected()) {
    return;
  }

  gMqtt.setServer(gMqttHost.c_str(), gMqttPort);
  gMqtt.setCallback(onMqttMessage);
  gMqtt.setBufferSize(kMqttPacketBufferBytes);

  String presenceTopic = buildDeviceMqttTopic("presence");
  String offlinePayload = buildPresencePayload("offline");
  Serial.printf("[mqtt] conectando em mqtt://%s:%u (%s)\n", gMqttHost.c_str(), gMqttPort, gMqttRootTopic.c_str());

  const bool connected = gMqtt.connect(
      gDeviceId.c_str(),
      gDeviceId.c_str(),
      gToken.c_str(),
      presenceTopic.c_str(),
      1,
      true,
      offlinePayload.c_str());

  if (!connected) {
    gMqttDisconnectedSinceMs = millis();
    return;
  }

  gMqttDisconnectedSinceMs = 0;
  (void)gMqtt.subscribe(buildDeviceMqttTopic("commands").c_str(), 1);
  (void)publishPresence("online");
  (void)publishDeviceLog("info", "mqtt", "connected", "Controle MQTT conectado.", false);
  (void)publishDeviceStats();
  sendTelemetry(true);
  publishPendingOtaReportIfNeeded();
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#fluxo-de-execucao
bool drawBars() {
  if (!gMatrixReady) {
    return false;
  }

  uint8_t binsSnapshot[kBinsCount];
  uint8_t levelSnapshot = 0;
  uint8_t streamBrightnessSnapshot = 0;
  {
    portENTER_CRITICAL(&gStreamBufferMux);
    const uint8_t index = gBinsActiveIndex;
    memcpy(binsSnapshot, gBinsBuffers[index], sizeof(binsSnapshot));
    levelSnapshot = gLevel;
    streamBrightnessSnapshot = gStreamBrightness;
    portEXIT_CRITICAL(&gStreamBufferMux);
  }

  const uint8_t bufferIndex = gMatrixShadowBackBufferIndex;
  uint8_t* renderedHeights = gMatrixShadowBarHeights[bufferIndex];
  if (gMatrixBufferModes[bufferIndex] != MatrixBufferMode::Bars) {
    clearMatrix();
    memset(renderedHeights, 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  }

  const uint16_t columnCount = (kBinsCount < kMatrixWidth) ? kBinsCount : kMatrixWidth;
  for (uint16_t x = 0; x < kMatrixWidth; x++) {
    uint8_t targetHeight = 0;
    RgbColor targetColor = {0, 0, 0};
    if (x < columnCount) {
      const uint16_t binIndex = (x * kBinsCount) / columnCount;
      const uint8_t amplitude = binsSnapshot[binIndex];
      targetHeight =
          static_cast<uint8_t>((static_cast<uint16_t>(amplitude) * kMatrixHalfHeight + 254u) / 255u);
      targetColor = rainbowColorForColumn(x, columnCount);
    }

    const uint8_t previousHeight = renderedHeights[x];
    if (targetHeight > previousHeight) {
      const uint8_t deltaHeight = static_cast<uint8_t>(targetHeight - previousHeight);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight - targetHeight),
          1,
          deltaHeight,
          targetColor);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight + previousHeight),
          1,
          deltaHeight,
          targetColor);
    } else if (targetHeight < previousHeight) {
      const uint8_t deltaHeight = static_cast<uint8_t>(previousHeight - targetHeight);
      const RgbColor black = {0, 0, 0};
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight - previousHeight),
          1,
          deltaHeight,
          black);
      fillMatrixRect(
          static_cast<int16_t>(x),
          static_cast<int16_t>(kMatrixHalfHeight + targetHeight),
          1,
          deltaHeight,
          black);
    }

    renderedHeights[x] = targetHeight;
  }

  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Bars;
  return commitMatrixFrame();
}

bool drawWaveMirrorVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::WaveMirror, palette);
  const int16_t midY = kMatrixHalfHeight;
  for (uint16_t x = 0; x < kMatrixWidth; x++) {
    const RgbColor centerColor = samplePaletteColor(effectivePalette, x / static_cast<float>(kMatrixWidth - 1u));
    drawMatrixPixel(static_cast<uint8_t>(x), static_cast<uint8_t>(midY), scaleColor(centerColor, 0.70f));
  }

  for (uint16_t x = 0; x < kMatrixWidth; x++) {
    const uint8_t amplitude = smoothBinsSample(bins, static_cast<int>(x));
    const uint8_t halfHeight = amplitudeToHeight(amplitude, static_cast<uint8_t>(kMatrixHalfHeight - 1));
    const RgbColor color = samplePaletteColor(effectivePalette, x / static_cast<float>(kMatrixWidth - 1u));
    const RgbColor glow = scaleColor(color, 0.42f);
    for (uint8_t offset = 0; offset <= halfHeight; offset++) {
      const int16_t yTop = midY - offset;
      const int16_t yBottom = midY + offset;
      drawMatrixPixel(static_cast<uint8_t>(x), static_cast<uint8_t>(yTop), color);
      drawMatrixPixel(static_cast<uint8_t>(x), static_cast<uint8_t>(yBottom), color);
      if (offset > 0 && x > 0) {
        drawMatrixPixel(static_cast<uint8_t>(x - 1), static_cast<uint8_t>(yTop), glow);
        drawMatrixPixel(static_cast<uint8_t>(x - 1), static_cast<uint8_t>(yBottom), glow);
      }
      if (offset > 0 && x + 1u < kMatrixWidth) {
        drawMatrixPixel(static_cast<uint8_t>(x + 1), static_cast<uint8_t>(yTop), glow);
        drawMatrixPixel(static_cast<uint8_t>(x + 1), static_cast<uint8_t>(yBottom), glow);
      }
    }
  }

  return finishBinsVisualFrame();
}

bool drawMirrorLinesVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::MirrorLines, palette);
  const int16_t midY = kMatrixHalfHeight;
  for (uint16_t x = 0; x < kMatrixWidth; x++) {
    const uint8_t amplitude = smoothBinsSample(bins, static_cast<int>(x));
    const uint8_t halfHeight = amplitudeToHeight(amplitude, static_cast<uint8_t>(kMatrixHalfHeight - 1));
    const RgbColor color = samplePaletteColor(effectivePalette, x / static_cast<float>(kMatrixWidth - 1u));
    for (uint8_t offset = 0; offset < halfHeight; offset++) {
      drawMatrixPixel(static_cast<uint8_t>(x), static_cast<uint8_t>(midY - offset), color);
      drawMatrixPixel(static_cast<uint8_t>(x), static_cast<uint8_t>(midY + offset), color);
    }
  }

  return finishBinsVisualFrame();
}

bool drawMirrorBlocksVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::MirrorBlocks, palette);
  const int16_t horizon = static_cast<int16_t>(kMatrixHeight * 0.62f);
  constexpr uint16_t kBlockCount = 64;
  for (uint16_t block = 0; block < kBlockCount; block++) {
    const uint16_t x = block * 2u;
    const uint8_t amplitude = sampleBinsAverage(bins, block * 2u, (block * 2u) + 2u);
    const uint8_t topHeight = amplitudeToHeight(amplitude, static_cast<uint8_t>(horizon));
    const uint8_t reflectionHeight = static_cast<uint8_t>(topHeight * 0.45f);
    const RgbColor color = samplePaletteColor(effectivePalette, block / static_cast<float>(kBlockCount - 1u));
    fillMatrixRect(static_cast<int16_t>(x), horizon - topHeight, 2, topHeight, color);
    fillMatrixRect(static_cast<int16_t>(x), horizon, 2, reflectionHeight, scaleColor(color, 0.38f));
  }

  return finishBinsVisualFrame();
}

bool drawClassicBarsVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::ClassicBars, palette);
  constexpr uint16_t kBarCount = 64;
  for (uint16_t bar = 0; bar < kBarCount; bar++) {
    const uint16_t x = bar * 2u;
    const uint8_t amplitude = sampleBinsAverage(bins, bar * 2u, (bar * 2u) + 2u);
    const uint8_t height = amplitudeToHeight(amplitude, kMatrixHeight - 1u);
    const uint8_t previousPeak = gBinsPeakHeights[bar];
    const uint8_t peak = height > previousPeak ? height : (previousPeak > 0 ? previousPeak - 1u : 0u);
    gBinsPeakHeights[bar] = peak;
    const RgbColor color = samplePaletteColor(effectivePalette, bar / static_cast<float>(kBarCount - 1u));
    fillMatrixRect(static_cast<int16_t>(x), static_cast<int16_t>(kMatrixHeight - height), 2, height, color);
    if (peak > 0) {
      fillMatrixRect(static_cast<int16_t>(x), static_cast<int16_t>(kMatrixHeight - peak), 2, 1, scaleColor(color, 0.95f));
    }
  }

  return finishBinsVisualFrame();
}

bool drawFlowLineVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::FlowLine, palette);
  constexpr uint16_t kSampleCount = 64;
  int16_t previousX = 0;
  int16_t previousY = static_cast<int16_t>(kMatrixHeight - amplitudeToHeight(sampleBinsAverage(bins, 0, 2), kMatrixHeight - 1u));
  for (uint16_t sample = 0; sample < kSampleCount; sample++) {
    const uint16_t x = sample * 2u;
    const uint8_t amplitude = sampleBinsAverage(bins, sample * 2u, (sample * 2u) + 2u);
    const int16_t y = static_cast<int16_t>(kMatrixHeight - amplitudeToHeight(amplitude, kMatrixHeight - 2u));
    const RgbColor color = samplePaletteColor(effectivePalette, sample / static_cast<float>(kSampleCount - 1u));
    gMatrix->drawLine(previousX, previousY, x, y, rgb888ToRgb565(color.r, color.g, color.b));
    if ((sample & 0x01u) == 0u) {
      fillMatrixRect(static_cast<int16_t>(x), y, 2, static_cast<int16_t>(kMatrixHeight - y), scaleColor(color, 0.22f));
    }

    previousX = static_cast<int16_t>(x);
    previousY = y;
  }

  return finishBinsVisualFrame();
}

