eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
bool drawHistoryScanVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::HistoryScan, palette);
  constexpr uint16_t kColumnCount = 64;
  uint8_t* currentRow = gBinsHistory[gBinsHistoryHead];
  for (uint16_t column = 0; column < kColumnCount; column++) {
    currentRow[column] = sampleBinsAverage(bins, column * 2u, (column * 2u) + 2u);
  }

  gBinsHistoryHead = static_cast<uint8_t>((gBinsHistoryHead + 1u) % kMatrixHeight);

  for (uint16_t row = 0; row < kMatrixHeight; row++) {
    const int historyIndex = (static_cast<int>(gBinsHistoryHead) - 1 - static_cast<int>(row) + kMatrixHeight) % kMatrixHeight;
    const uint8_t* historyRow = gBinsHistory[historyIndex];
    for (uint16_t column = 0; column < kColumnCount; column++) {
      const uint8_t amplitude = historyRow[column];
      if (amplitude < 6u) {
        continue;
      }

      const float paletteT = clamp01f((amplitude / 255.0f) * 0.85f + (column / static_cast<float>(kColumnCount - 1u)) * 0.15f);
      const RgbColor color = samplePaletteColor(effectivePalette, paletteT);
      fillMatrixRect(static_cast<int16_t>(column * 2u), static_cast<int16_t>(kMatrixHeight - 1u - row), 2, 1, color);
    }
  }

  return finishBinsVisualFrame();
}

bool drawRadialOrbitVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::RadialOrbit, palette);
  const int16_t centerX = kMatrixWidth / 2;
  const int16_t centerY = kMatrixHeight / 2;
  constexpr uint16_t kRayCount = 48;
  const float baseRadius = 7.0f;
  const float maxRadius = 28.0f;
  for (uint16_t ray = 0; ray < kRayCount; ray++) {
    const uint16_t binStart = static_cast<uint16_t>((ray * kBinsCount) / kRayCount);
    const uint16_t binEnd = static_cast<uint16_t>(((ray + 1u) * kBinsCount) / kRayCount);
    const uint8_t amplitude = sampleBinsAverage(bins, binStart, binEnd);
    const float angle = (static_cast<float>(ray) / static_cast<float>(kRayCount)) * 6.2831853f - 1.5707963f;
    const float radius = baseRadius + ((amplitude / 255.0f) * maxRadius);
    const int16_t endX = static_cast<int16_t>(roundf(centerX + cosf(angle) * radius));
    const int16_t endY = static_cast<int16_t>(roundf(centerY + sinf(angle) * radius));
    const RgbColor color = samplePaletteColor(effectivePalette, ray / static_cast<float>(kRayCount - 1u));
    gMatrix->drawLine(centerX, centerY, endX, endY, rgb888ToRgb565(color.r, color.g, color.b));
    fillMatrixRect(endX - 1, endY - 1, 2, 2, scaleColor(color, 0.68f));
  }

  fillMatrixRect(centerX - 2, centerY - 2, 4, 4, scaleColor(samplePaletteColor(effectivePalette, 0.5f), 0.72f));
  return finishBinsVisualFrame();
}

bool drawAtmosphereVisual(const uint8_t* bins, Hub75BinsPaletteFamily palette, uint8_t level) {
  clearMatrix();
  const Hub75BinsPaletteFamily effectivePalette = resolveBinsEffectivePalette(Hub75BinsVisualStyle::Atmosphere, palette);
  constexpr uint16_t kSampleCount = 64;
  const float time = millis() / 1000.0f;
  const float globalLevel = level / 255.0f;
  for (uint8_t ribbon = 0; ribbon < 3u; ribbon++) {
    const float baseline = kMatrixHeight * (0.24f + (ribbon * 0.22f));
    const float phase = time * (0.9f + (ribbon * 0.22f));
    int16_t previousX = 0;
    int16_t previousY = static_cast<int16_t>(baseline);
    for (uint16_t sample = 0; sample < kSampleCount; sample++) {
      const uint16_t x = sample * 2u;
      const uint8_t amplitude = sampleBinsAverage(bins, sample * 2u, (sample * 2u) + 2u);
      const float energy = amplitude / 255.0f;
      const float wave = sinf((sample * 0.22f) + phase + ribbon) * (5.0f + (globalLevel * 4.0f));
      const int16_t y = static_cast<int16_t>(roundf(baseline + wave - (energy * 16.0f)));
      const float colorT = clamp01f((sample / static_cast<float>(kSampleCount - 1u)) * 0.65f + (ribbon * 0.18f));
      const RgbColor color = samplePaletteColor(effectivePalette, colorT);
      gMatrix->drawLine(previousX, previousY, x, y, rgb888ToRgb565(color.r, color.g, color.b));
      if ((sample % 6u) == 0u) {
        fillMatrixRect(x - 1, y - 1, 3, 3, scaleColor(color, 0.52f + (energy * 0.30f)));
      }

      previousX = static_cast<int16_t>(x);
      previousY = y;
    }
  }

  const RgbColor bloom = samplePaletteColor(effectivePalette, 0.35f + (globalLevel * 0.25f));
  fillMatrixRect((kMatrixWidth / 2) - 6, (kMatrixHeight / 2) - 4, 12, 8, scaleColor(bloom, 0.30f + (globalLevel * 0.30f)));
  return finishBinsVisualFrame();
}

bool drawLaunchpadGridVisual(const uint8_t* bins) {
  clearMatrix();
  const RgbColor deviceBody = {10, 12, 16};
  const RgbColor padOff = {34, 38, 46};
  const RgbColor topOff = {58, 64, 72};
  fillMatrixRect(18, 4, 92, 56, deviceBody);
  constexpr uint8_t kGridSize = 8;
  constexpr uint8_t kPadWidth = 9;
  constexpr uint8_t kPadHeight = 5;
  constexpr uint8_t kPadGapX = 2;
  constexpr uint8_t kPadGapY = 1;
  constexpr uint8_t kGridLeft = 22;
  constexpr uint8_t kGridTop = 12;
  for (uint8_t row = 0; row < kGridSize; row++) {
    for (uint8_t col = 0; col < kGridSize; col++) {
      const uint8_t padIndex = static_cast<uint8_t>(row * kGridSize + col);
      const uint8_t target = sampleBinsAverage(bins, padIndex * 2u, (padIndex * 2u) + 2u);
      const uint8_t previous = gLaunchpadPadLevels[padIndex];
      const uint8_t levelValue = target > previous ? target : (previous > 14u ? previous - 14u : 0u);
      gLaunchpadPadLevels[padIndex] = levelValue;
      const uint8_t x = kGridLeft + col * (kPadWidth + kPadGapX);
      const uint8_t y = kGridTop + row * (kPadHeight + kPadGapY);
      fillMatrixRect(x, y, kPadWidth, kPadHeight, padOff);
      if (levelValue > 6u) {
        const float colorT = clamp01f((col / 7.0f) * 0.55f + (row / 7.0f) * 0.25f + (levelValue / 255.0f) * 0.20f);
        const RgbColor activeColor = samplePaletteColor(Hub75BinsPaletteFamily::Neon, colorT);
        fillMatrixRect(x + 1, y + 1, kPadWidth - 2, kPadHeight - 2, scaleColor(activeColor, 0.35f + (levelValue / 255.0f) * 0.65f));
      }
    }
  }

