eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  for (uint8_t col = 0; col < kGridSize; col++) {
    const uint8_t target = sampleBinsAverage(bins, col * 4u, (col * 4u) + 4u);
    const uint8_t previous = gLaunchpadTopLevels[col];
    gLaunchpadTopLevels[col] = target > previous ? target : (previous > 18u ? previous - 18u : 0u);
    const uint8_t x = kGridLeft + col * (kPadWidth + kPadGapX) + 2u;
    fillMatrixRect(x, 7, kPadWidth - 4u, 3, topOff);
    if (gLaunchpadTopLevels[col] > 12u) {
      const RgbColor color = samplePaletteColor(Hub75BinsPaletteFamily::Plasma, col / 7.0f);
      fillMatrixRect(x, 7, kPadWidth - 4u, 3, scaleColor(color, 0.28f + (gLaunchpadTopLevels[col] / 255.0f) * 0.72f));
    }
  }

  for (uint8_t row = 0; row < kGridSize; row++) {
    const uint8_t target = sampleBinsAverage(bins, row * 4u, (row * 4u) + 4u);
    const uint8_t previous = gLaunchpadSideLevels[row];
    gLaunchpadSideLevels[row] = target > previous ? target : (previous > 18u ? previous - 18u : 0u);
    const uint8_t y = kGridTop + row * (kPadHeight + kPadGapY) + 1u;
    fillMatrixRect(112, y, 3, kPadHeight - 2u, topOff);
    if (gLaunchpadSideLevels[row] > 12u) {
      const RgbColor color = samplePaletteColor(Hub75BinsPaletteFamily::Aurora, row / 7.0f);
      fillMatrixRect(112, y, 3, kPadHeight - 2u, scaleColor(color, 0.28f + (gLaunchpadSideLevels[row] / 255.0f) * 0.72f));
    }
  }

  return finishBinsVisualFrame();
}

bool drawBinsVisual() {
  if (!gMatrixReady) {
    return false;
  }

  uint8_t binsSnapshot[kBinsCount];
  uint8_t levelSnapshot = 0;
  uint8_t flagsSnapshot = 0;
  {
    portENTER_CRITICAL(&gStreamBufferMux);
    const uint8_t index = gBinsActiveIndex;
    memcpy(binsSnapshot, gBinsBuffers[index], sizeof(binsSnapshot));
    levelSnapshot = gLevel;
    flagsSnapshot = gBinsFlags;
    portEXIT_CRITICAL(&gStreamBufferMux);
  }

  const Hub75BinsVisualStyle style = decodeBinsVisualStyle(flagsSnapshot);
  const Hub75BinsPaletteFamily palette = decodeBinsPaletteFamily(flagsSnapshot);
  const uint8_t styleId = static_cast<uint8_t>(style);
  if (styleId != gLastBinsStyleId) {
    resetBinsVisualState();
    gLastBinsStyleId = styleId;
  }

  switch (style) {
    case Hub75BinsVisualStyle::WaveMirror:
      return drawWaveMirrorVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::MirrorLines:
      return drawMirrorLinesVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::MirrorBlocks:
      return drawMirrorBlocksVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::ClassicBars:
      return drawClassicBarsVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::FlowLine:
      return drawFlowLineVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::HistoryScan:
      return drawHistoryScanVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::RadialOrbit:
      return drawRadialOrbitVisual(binsSnapshot, palette);
    case Hub75BinsVisualStyle::Atmosphere:
      return drawAtmosphereVisual(binsSnapshot, palette, levelSnapshot);
    case Hub75BinsVisualStyle::LaunchpadGrid:
      return drawLaunchpadGridVisual(binsSnapshot);
    case Hub75BinsVisualStyle::LegacyFallback:
    default:
      return drawBars();
  }
}

bool drawFrame128x64() {
  if (!gMatrixReady) {
    return false;
  }

  const uint8_t bufferIndex = gMatrixShadowBackBufferIndex;
  const uint8_t frameIndex = gFrameRgb565ActiveIndex;
  const uint16_t* frame = gFrameRgb565Buffers[frameIndex];
  // Bulk RGB565 path writes the full frame directly into the HUB75 BCM back buffer.
  gMatrix->writeFrameRGB565(frame);
  memcpy(gMatrixShadowFrames[bufferIndex], frame, sizeof(gFrameRgb565Buffers[0]));
  memset(gMatrixShadowBarHeights[bufferIndex], 0, sizeof(gMatrixShadowBarHeights[bufferIndex]));
  gMatrixBufferModes[bufferIndex] = MatrixBufferMode::Frame;
  return commitMatrixFrame();
}

void processNetworkPoll() {
  const uint32_t networkBudgetStartUs = micros();
  bool networkBudgetExhausted = false;
  auto shouldRunNetworkStep = [&](bool eligible) -> bool {
    if (!eligible) {
      return false;
    }

    if (networkBudgetExhausted) {
      gNetworkPollDeferCount++;
      return false;
    }

    return true;
  };
  auto finishNetworkStep = [&]() {
    if (elapsedMicrosSince(networkBudgetStartUs) >= kNetworkPollBudgetUs) {
      networkBudgetExhausted = true;
    }
  };

  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  if (!wifiConnected) {
    if (shouldRunNetworkStep(gWifiDisconnectedSinceMs == 0)) {
      gWifiDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateDisconnected, "wifi_disconnected", true);
      Serial.println("[wifi] desconectado, aguardando reconexao.");
      finishNetworkStep();
    }

    const bool shouldStartProvisioningFallback =
        !gProvisioningPortalActive
        && gWifiDisconnectedSinceMs != 0
        && (millis() - gWifiDisconnectedSinceMs) > kWifiDisconnectProvisioningFallbackMs;
    bool provisioningStarted = false;
    if (shouldRunNetworkStep(shouldStartProvisioningFallback)) {
      Serial.println("[wifi] fallback para provisioning apos queda prolongada.");
      (void)startProvisioningPortal("wifi_disconnected_fallback");
      gWifiDisconnectedSinceMs = 0;
      provisioningStarted = true;
      finishNetworkStep();
    }

    if (provisioningStarted) {
      if (shouldRunNetworkStep(true)) {
        connectMqtt();
        finishNetworkStep();
      }
      if (shouldRunNetworkStep(true)) {
        connectWebSocket();
        finishNetworkStep();
      }
    }
  } else {
    if (gWifiDisconnectedSinceMs != 0) {
      gWifiDisconnectedSinceMs = 0;
    }

    if (shouldRunNetworkStep(gProvisioningPortalActive)) {
      setProvisioningPortalActive(false, "portal_closed");
      finishNetworkStep();
    }

    if (shouldRunNetworkStep(true)) {
      setConnectivityState(kWifiStateConnected, "wifi_connected");
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      gMqtt.loop();
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      gWs.loop();
      finishNetworkStep();
    }
    if (shouldRunNetworkStep(true)) {
      flushWsFlapDiagnostics(false);
      finishNetworkStep();
    }

